[Survived] BlockStatement
src/components/MusicLoop/MusicLoop.tsx:21:18
 	const [interaction, setInteraction] = useState<boolean>(false);
 	const audioRef = useRef<HTMLAudioElement>(null);
 	
-	useEffect(() => {
-		document.addEventListener('click', () => setInteraction(true));
-
-		return () => {
-			document.removeEventListener('click', () => setInteraction(true));
-		};
-	},)
+	useEffect(() => {},)
 
 	useKey(window, {

[Survived] ArrowFunction
src/components/MusicLoop/MusicLoop.tsx:22:38
 	const audioRef = useRef<HTMLAudioElement>(null);
 	
 	useEffect(() => {
-		document.addEventListener('click', () => setInteraction(true));
+		document.addEventListener('click', () => undefined);
 
 		return () => {

[Survived] BooleanLiteral
src/components/MusicLoop/MusicLoop.tsx:22:59
 	const audioRef = useRef<HTMLAudioElement>(null);
 	
 	useEffect(() => {
-		document.addEventListener('click', () => setInteraction(true));
+		document.addEventListener('click', () => setInteraction(false));
 
 		return () => {

[Survived] BlockStatement
src/components/MusicLoop/MusicLoop.tsx:24:16
 	useEffect(() => {
 		document.addEventListener('click', () => setInteraction(true));
 
-		return () => {
-			document.removeEventListener('click', () => setInteraction(true));
-		};
+		return () => {};
 	},)
 

[Survived] ArrowFunction
src/components/MusicLoop/MusicLoop.tsx:25:42
 		document.addEventListener('click', () => setInteraction(true));
 
 		return () => {
-			document.removeEventListener('click', () => setInteraction(true));
+			document.removeEventListener('click', () => undefined);
 		};
 	},)

[Survived] BooleanLiteral
src/components/MusicLoop/MusicLoop.tsx:25:63
 		document.addEventListener('click', () => setInteraction(true));
 
 		return () => {
-			document.removeEventListener('click', () => setInteraction(true));
+			document.removeEventListener('click', () => setInteraction(false));
 		};
 	},)

[Killed] ArrowFunction
src/components/MusicLoop/MusicLoop.tsx:30:12
 	},)
 
 	useKey(window, {
-		ArrowUp: () => setInteraction(true),
+		ArrowUp: () => undefined,
 		ArrowDown: () => setInteraction(true),
 	})
killedBy: MusicLoop component Does it call setInteraction when arrow key is pressed ?
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Survived] BooleanLiteral
src/components/MusicLoop/MusicLoop.tsx:30:33
 	},)
 
 	useKey(window, {
-		ArrowUp: () => setInteraction(true),
+		ArrowUp: () => setInteraction(false),
 		ArrowDown: () => setInteraction(true),
 	})

[Killed] BooleanLiteral
src/components/MusicLoop/MusicLoop.tsx:31:35
 
 	useKey(window, {
 		ArrowUp: () => setInteraction(true),
-		ArrowDown: () => setInteraction(true),
+		ArrowDown: () => setInteraction(false),
 	})
 
killedBy: MusicLoop component render after user interaction (arrow key press)
statusReason: Error: Unable to find an element by: [data-testid="source"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="empty"
    />

[Killed] ArrowFunction
src/components/MusicLoop/MusicLoop.tsx:31:14
 
 	useKey(window, {
 		ArrowUp: () => setInteraction(true),
-		ArrowDown: () => setInteraction(true),
+		ArrowDown: () => undefined,
 	})
 
killedBy: MusicLoop component Does it call setInteraction when arrow key is pressed ?
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/components/MusicLoop/MusicLoop.tsx:34:19
 		ArrowDown: () => setInteraction(true),
 	})
 
-	if (interaction) {
-		return (
-			<audio ref={audioRef} data-testid="audio" autoPlay loop muted={mute} key={music}>
-				<source data-testid="source" src={require(`./${music}.mp3`)} type="audio/mp3" />
-			</audio>
-		)
-	}
+	if (interaction) {}
 	else {
 		return (<div data-testid="empty" />);
killedBy: MusicLoop component render after user interaction (arrow key press)
statusReason: Error: Unable to find an element by: [data-testid="source"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/components/MusicLoop/MusicLoop.tsx:41:7
 			</audio>
 		)
 	}
-	else {
-		return (<div data-testid="empty" />);
-	}
+	else {}
 
 }
killedBy: MusicLoop component no render without interaction but empty fragment is here
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="empty"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
