[Killed] BlockStatement
src/utils/crypto.ts:3:51
 import * as CryptoJS from 'crypto-js';
 
-export function encryptData(text: string): string {
-	const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "";
-	return CryptoJS.AES.encrypt(text, secretPass).toString();
-}
+export function encryptData(text: string): string {}
 
 export function decryptData(text: string): string | false {
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] LogicalOperator
src/utils/crypto.ts:4:21
 import * as CryptoJS from 'crypto-js';
 
 export function encryptData(text: string): string {
-	const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "";
+	const secretPass = process.env.REACT_APP_CRYPTO_KEY && "";
 	return CryptoJS.AES.encrypt(text, secretPass).toString();
 }
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] BlockStatement
src/utils/crypto.ts:8:59
 	return CryptoJS.AES.encrypt(text, secretPass).toString();
 }
 
-export function decryptData(text: string): string | false {
-	try {
-		const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "";
-		const bytes = CryptoJS.AES.decrypt(text, secretPass);
-		const data = bytes.toString(CryptoJS.enc.Utf8);
-		return data;
-	} catch (error) {
-		return false;
-	}
-};
+export function decryptData(text: string): string | false {};
 
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] BlockStatement
src/utils/crypto.ts:9:6
 }
 
 export function decryptData(text: string): string | false {
-	try {
-		const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "";
-		const bytes = CryptoJS.AES.decrypt(text, secretPass);
-		const data = bytes.toString(CryptoJS.enc.Utf8);
-		return data;
-	} catch (error) {
+	try {} catch (error) {
 		return false;
 	}
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] LogicalOperator
src/utils/crypto.ts:10:22
 
 export function decryptData(text: string): string | false {
 	try {
-		const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "";
+		const secretPass = process.env.REACT_APP_CRYPTO_KEY && "";
 		const bytes = CryptoJS.AES.decrypt(text, secretPass);
 		const data = bytes.toString(CryptoJS.enc.Utf8);
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] StringLiteral
src/utils/crypto.ts:10:58
 
 export function decryptData(text: string): string | false {
 	try {
-		const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "";
+		const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "Stryker was here!";
 		const bytes = CryptoJS.AES.decrypt(text, secretPass);
 		const data = bytes.toString(CryptoJS.enc.Utf8);
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] BlockStatement
src/utils/crypto.ts:14:18
 		const bytes = CryptoJS.AES.decrypt(text, secretPass);
 		const data = bytes.toString(CryptoJS.enc.Utf8);
 		return data;
-	} catch (error) {
-		return false;
-	}
+	} catch (error) {}
 };
 
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >
