[Killed] BlockStatement
src/utils/crypto.ts:3:43
 import * as CryptoJS from 'crypto-js';
 
-export function encryptData(text: string) {
-	const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "";
-	return CryptoJS.AES.encrypt(text, secretPass).toString();
-}
+export function encryptData(text: string) {}
 
 export function decryptData(text: string) {
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] LogicalOperator
src/utils/crypto.ts:4:21
 import * as CryptoJS from 'crypto-js';
 
 export function encryptData(text: string) {
-	const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "";
+	const secretPass = process.env.REACT_APP_CRYPTO_KEY && "";
 	return CryptoJS.AES.encrypt(text, secretPass).toString();
 }
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] BlockStatement
src/utils/crypto.ts:8:43
 	return CryptoJS.AES.encrypt(text, secretPass).toString();
 }
 
-export function decryptData(text: string) {
-	const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "";
-	const bytes = CryptoJS.AES.decrypt(text, secretPass);
-	const data = bytes.toString(CryptoJS.enc.Utf8);
-	return data;
-};
+export function decryptData(text: string) {};
 
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'slice')

[Killed] LogicalOperator
src/utils/crypto.ts:9:21
 }
 
 export function decryptData(text: string) {
-	const secretPass = process.env.REACT_APP_CRYPTO_KEY ?? "";
+	const secretPass = process.env.REACT_APP_CRYPTO_KEY && "";
 	const bytes = CryptoJS.AES.decrypt(text, secretPass);
 	const data = bytes.toString(CryptoJS.enc.Utf8);
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: Malformed UTF-8 data
