[Survived] BlockStatement
src/components/Player/Player.tsx:33:18
 	const [aboveY, belowY] = useClickRef(playerRef);
 
 	
-	useEffect(() => {
-		if (aboveY) { setKeyPressed('Down') }
-		if (belowY) { setKeyPressed('Up') }
-	}, [aboveY, belowY, setKeyPressed])
+	useEffect(() => {}, [aboveY, belowY, setKeyPressed])
 
 	useKey(window, {

[Killed] ConditionalExpression
src/components/Player/Player.tsx:34:7
 
 	
 	useEffect(() => {
-		if (aboveY) { setKeyPressed('Down') }
+		if (true) { setKeyPressed('Down') }
 		if (belowY) { setKeyPressed('Up') }
 	}, [aboveY, belowY, setKeyPressed])
killedBy: Player Component renders player with their accurate style and callback work ?
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 3

[Survived] BlockStatement
src/components/Player/Player.tsx:34:15
 
 	
 	useEffect(() => {
-		if (aboveY) { setKeyPressed('Down') }
+		if (aboveY) {}
 		if (belowY) { setKeyPressed('Up') }
 	}, [aboveY, belowY, setKeyPressed])

[Killed] ConditionalExpression
src/components/Player/Player.tsx:35:7
 	
 	useEffect(() => {
 		if (aboveY) { setKeyPressed('Down') }
-		if (belowY) { setKeyPressed('Up') }
+		if (true) { setKeyPressed('Up') }
 	}, [aboveY, belowY, setKeyPressed])
 
killedBy: Game Scene Player move when a key is pressed
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 333
Received:   292

[Survived] BlockStatement
src/components/Player/Player.tsx:35:15
 	
 	useEffect(() => {
 		if (aboveY) { setKeyPressed('Down') }
-		if (belowY) { setKeyPressed('Up') }
+		if (belowY) {}
 	}, [aboveY, belowY, setKeyPressed])
 

[Killed] ArrowFunction
src/components/Player/Player.tsx:39:12
 	}, [aboveY, belowY, setKeyPressed])
 
 	useKey(window, {
-		ArrowUp: () => setKeyPressed("Up"),
+		ArrowUp: () => undefined,
 		ArrowDown: () => setKeyPressed("Down"),
 	})
killedBy: Player Component renders player with their accurate style and callback work ?
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Up"
Received: "Down"

Number of calls: 1

[Killed] StringLiteral
src/components/Player/Player.tsx:39:32
 	}, [aboveY, belowY, setKeyPressed])
 
 	useKey(window, {
-		ArrowUp: () => setKeyPressed("Up"),
+		ArrowUp: () => setKeyPressed(""),
 		ArrowDown: () => setKeyPressed("Down"),
 	})
killedBy: Player Component renders player with their accurate style and callback work ?
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Up"
Received
       1: ""
       2: "Down"

Number of calls: 2

[Killed] ArrowFunction
src/components/Player/Player.tsx:40:14
 
 	useKey(window, {
 		ArrowUp: () => setKeyPressed("Up"),
-		ArrowDown: () => setKeyPressed("Down"),
+		ArrowDown: () => undefined,
 	})
 
killedBy: Game Scene Player move when a key is pressed
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 333
Received:   322

[Killed] StringLiteral
src/components/Player/Player.tsx:40:34
 
 	useKey(window, {
 		ArrowUp: () => setKeyPressed("Up"),
-		ArrowDown: () => setKeyPressed("Down"),
+		ArrowDown: () => setKeyPressed(""),
 	})
 
killedBy: Player Component renders player with their accurate style and callback work ?
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Down"
Received
       1: "Up"
       2: ""

Number of calls: 2
