[Killed] ConditionalExpression
src/components/Score/Score.tsx:45:7
 	}
 
 	const registerScore = async () => {
-		if (!scoreSubmit) {
+		if (true) {
 			const connection: any = await connectSupaBase();
 			await insertScore(connection, { name: name, score: score });
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] BlockStatement
src/components/Score/Score.tsx:45:21
 	}
 
 	const registerScore = async () => {
-		if (!scoreSubmit) {
-			const connection: any = await connectSupaBase();
-			await insertScore(connection, { name: name, score: score });
-			setScoreSubmit(true);
-		}
+		if (!scoreSubmit) {}
 	}
 
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] BlockStatement
src/components/Score/Score.tsx:55:59
 	if (keyEnter && isItActualPlayer) { registerScore(); }
 
 
-	const displayInputScore = (isItActualPlayer: boolean) => {
-		if (isItActualPlayer) {
-			return (
-				<input className={keyEnter ? 'name' : 'name animate'}
-					onChange={(e) => checkName(e.target.value)}
-					value={name}
-					maxLength={10}
-					disabled={keyEnter ? true : false}
-					autoFocus={true}
-				/>
-			)
-		}
-		else {
-			return (
-				<div data-testid="name" className="name">{name}</div>
-			)
-		}
-	}
+	const displayInputScore = (isItActualPlayer: boolean) => {}
 
 	return (
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] ConditionalExpression
src/components/Score/Score.tsx:56:7
 
 
 	const displayInputScore = (isItActualPlayer: boolean) => {
-		if (isItActualPlayer) {
+		if (true) {
 			return (
 				<input className={keyEnter ? 'name' : 'name animate'}
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] BlockStatement
src/components/Score/Score.tsx:67:8
 				/>
 			)
 		}
-		else {
-			return (
-				<div data-testid="name" className="name">{name}</div>
-			)
-		}
+		else {}
 	}
 
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >
