[Killed] BlockStatement
src/data/supabase.ts:20:48
  * @param supabase A Supabase client
  * @returns Return all data from the database as a array of object or return false if the operation fails.
  */
-export async function readScore(supabase: any) {
-	const response = await supabase.from('boule_infernal').select('*');
-	const responseData = response.data ?? false;
-
-	if (!responseData && response.status !== 200) { return false; };
-
-	return responseData.filter((value: any) => {
-		const isNameCorrect = regexUser.test(value.name);
-		value.score = decryptData(value.score);
-		value.score = Number.parseInt(value.score);
-
-		if (value.score && isNameCorrect) {
-			return true;
-		}
-		return false;
-	})
-}
+export async function readScore(supabase: any) {}
 
 /**
killedBy: HighScore Scene Scores Name are visible
statusReason: TypeError: Cannot read properties of undefined (reading 'sort')

[Killed] BlockStatement
src/data/supabase.ts:26:45
 
 	if (!responseData && response.status !== 200) { return false; };
 
-	return responseData.filter((value: any) => {
-		const isNameCorrect = regexUser.test(value.name);
-		value.score = decryptData(value.score);
-		value.score = Number.parseInt(value.score);
-
-		if (value.score && isNameCorrect) {
-			return true;
-		}
-		return false;
-	})
+	return responseData.filter((value: any) => {})
 }
 
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Survived] MethodExpression
src/data/supabase.ts:26:9
 
 	if (!responseData && response.status !== 200) { return false; };
 
-	return responseData.filter((value: any) => {
-		const isNameCorrect = regexUser.test(value.name);
-		value.score = decryptData(value.score);
-		value.score = Number.parseInt(value.score);
-
-		if (value.score && isNameCorrect) {
-			return true;
-		}
-		return false;
-	})
+	return responseData
 }
 

[Killed] BlockStatement
src/data/supabase.ts:31:37
 		value.score = decryptData(value.score);
 		value.score = Number.parseInt(value.score);
 
-		if (value.score && isNameCorrect) {
-			return true;
-		}
+		if (value.score && isNameCorrect) {}
 		return false;
 	})
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Timeout] ConditionalExpression
src/data/supabase.ts:31:7
 		value.score = decryptData(value.score);
 		value.score = Number.parseInt(value.score);
 
-		if (value.score && isNameCorrect) {
+		if (false) {
 			return true;
 		}

[Killed] BooleanLiteral
src/data/supabase.ts:32:11
 		value.score = Number.parseInt(value.score);
 
 		if (value.score && isNameCorrect) {
-			return true;
+			return false;
 		}
 		return false;
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] StringLiteral
src/data/supabase.ts:45:39
  * @returns True if the values were inserted successfully, false if an error occurred.
  */
 export async function insertScore(supabase: any, scoreObject: ScoreObject) {
-	const response = await supabase.from('boule_infernal').insert({
+	const response = await supabase.from("").insert({
 		name: scoreObject.name,
 		score: encryptData(scoreObject.score.toString()),
killedBy: Database Tests Insert Data Successfully
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/data/supabase.ts:49:40
 		name: scoreObject.name,
 		score: encryptData(scoreObject.score.toString()),
 	});
-	if (response.status === 201) { return true; }
+	if (response.status === 201) { return false; }
 	return false;
 }
killedBy: Database Tests Insert Data Successfully
statusReason: Error: expect(received).toBeTruthy()

Received: false
