[Killed] BooleanLiteral
src/redux/initialStates.ts:14:8
 	maxScore: 0,
 	gameOver: false,
 	speed: 70,  
-	mute: true,
+	mute: false,
 };
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >
