[Killed] StringLiteral
src/scene/Game.tsx:50:12
 		<>
 			<SoundControl />
 			<div data-testid="game" className={gameOver ? "game dead" : "game"} style={{
-				width: `${widthGame}px`,
+				width: ``,
 				height: `${heightGame}px`,
 				padding: `${topStart}px`,
killedBy: Game Scene Game is stylized with its props
statusReason: Error: expect(element).toHaveStyle()

- Expected

  height: 500px;
- width: 300px;
