[Killed] BlockStatement
src/scene/HighScore.tsx:32:28
 
 	// Recursive function generate "#"
 	const hashTag: any = (numberHashTag: number) => {
-		if (numberHashTag !== 0) {
-			return "#" + hashTag(numberHashTag - 1);
-		}
+		if (numberHashTag !== 0) {}
 		return "";
 	}
killedBy: HighScore Scene Scores Name are visible
statusReason: Error: Unable to find an element by: [data-testid="name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >
