[Killed] BlockStatement
src/utils/mapGenerator.ts:53:42
 	 *@returns An object with the updated property "level","numberWall","numberGoal" representing the generated map.
 	 */
 	generateMapLevel() {
-		this.level = this.level.map((value) => {
-			// Do not replace green blocks in the map level.
-			if (value === 1) return value;
-
-			// Random a number
-			const randomNumber = Math.round(Math.random() * 50);
-
-			// Do not generate wall blocks if it reach maximum number of wall blocks has been reached.
-			if (randomNumber === 2 && this.numberWall < this.numberMaxWall) {
-				this.numberWall++;
-				return randomNumber;
-			}
-
-			// Do not generate goal blocks if the maximum number of goal blocks has been reached.
-			if (randomNumber === 3 && this.numberGoal < this.numberMaxGoal) {
-				this.numberGoal++;
-				return randomNumber;
-			}
-
-			return value;
-		});
+		this.level = this.level.map((value) => {});
 
 		// Ensure that the previous block in the map cannot be a goal or wall if it is currently a goal or wall block.
killedBy: App Test Game is visible
statusReason: Error: Maximum update depth exceeded. This can happen when a component repeatedly calls setState inside componentWillUpdate or componentDidUpdate. React limits the number of nested updates to prevent infinite loops.

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:55:8
 	generateMapLevel() {
 		this.level = this.level.map((value) => {
 			// Do not replace green blocks in the map level.
-			if (value === 1) return value;
+			if (true) return value;
 
 			// Random a number
killedBy: App Test Game is visible
statusReason: Error: Maximum update depth exceeded. This can happen when a component repeatedly calls setState inside componentWillUpdate or componentDidUpdate. React limits the number of nested updates to prevent infinite loops.

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:55:8
 	generateMapLevel() {
 		this.level = this.level.map((value) => {
 			// Do not replace green blocks in the map level.
-			if (value === 1) return value;
+			if (false) return value;
 
 			// Random a number
killedBy: MapGenerator Class Generate a map without replacing green blocks represented as 1 in the array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 73
Received: 76

[Killed] EqualityOperator
src/utils/mapGenerator.ts:61:8
 			const randomNumber = Math.round(Math.random() * 50);
 
 			// Do not generate wall blocks if it reach maximum number of wall blocks has been reached.
-			if (randomNumber === 2 && this.numberWall < this.numberMaxWall) {
+			if (randomNumber !== 2 && this.numberWall < this.numberMaxWall) {
 				this.numberWall++;
 				return randomNumber;
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 8
Received: 9

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:61:8
 			const randomNumber = Math.round(Math.random() * 50);
 
 			// Do not generate wall blocks if it reach maximum number of wall blocks has been reached.
-			if (randomNumber === 2 && this.numberWall < this.numberMaxWall) {
+			if (false) {
 				this.numberWall++;
 				return randomNumber;
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   0

[Killed] LogicalOperator
src/utils/mapGenerator.ts:67:8
 			}
 
 			// Do not generate goal blocks if the maximum number of goal blocks has been reached.
-			if (randomNumber === 3 && this.numberGoal < this.numberMaxGoal) {
+			if (randomNumber === 3 || this.numberGoal < this.numberMaxGoal) {
 				this.numberGoal++;
 				return randomNumber;
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
src/utils/mapGenerator.ts:67:30
 			}
 
 			// Do not generate goal blocks if the maximum number of goal blocks has been reached.
-			if (randomNumber === 3 && this.numberGoal < this.numberMaxGoal) {
+			if (randomNumber === 3 && this.numberGoal >= this.numberMaxGoal) {
 				this.numberGoal++;
 				return randomNumber;
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   0

[Killed] BlockStatement
src/utils/mapGenerator.ts:76:63
 		});
 
 		// Ensure that the previous block in the map cannot be a goal or wall if it is currently a goal or wall block.
-		return this.level = this.level.map((value, index, array) => {
-
-			const previousValue = array[index - 1];
-			if (previousValue === 2 || previousValue === 3) {
-				if (value === 2) {
-					this.numberWall--;
-					return 0;
-				}
-				if (value === 3) {
-					this.numberGoal--;
-					return 0;
-				}
-			}
-
-			return value;
-		});
+		return this.level = this.level.map((value, index, array) => {});
 
 	}
killedBy: MapGenerator Class Generate a map without replacing green blocks represented as 1 in the array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 76

[Survived] ArithmeticOperator
src/utils/mapGenerator.ts:78:32
 		// Ensure that the previous block in the map cannot be a goal or wall if it is currently a goal or wall block.
 		return this.level = this.level.map((value, index, array) => {
 
-			const previousValue = array[index - 1];
+			const previousValue = array[index + 1];
 			if (previousValue === 2 || previousValue === 3) {
 				if (value === 2) {

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:79:31
 		return this.level = this.level.map((value, index, array) => {
 
 			const previousValue = array[index - 1];
-			if (previousValue === 2 || previousValue === 3) {
+			if (previousValue === 2 || false) {
 				if (value === 2) {
 					this.numberWall--;
killedBy: MapGenerator Class Ensure that the previous block in the map cannot be a goal or wall if it is currently a goal or wall block.
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:79:8
 		return this.level = this.level.map((value, index, array) => {
 
 			const previousValue = array[index - 1];
-			if (previousValue === 2 || previousValue === 3) {
+			if (false) {
 				if (value === 2) {
 					this.numberWall--;
killedBy: MapGenerator Class Ensure that the previous block in the map cannot be a goal or wall if it is currently a goal or wall block.
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/utils/mapGenerator.ts:80:22
 
 			const previousValue = array[index - 1];
 			if (previousValue === 2 || previousValue === 3) {
-				if (value === 2) {
-					this.numberWall--;
-					return 0;
-				}
+				if (value === 2) {}
 				if (value === 3) {
 					this.numberGoal--;
killedBy: MapGenerator Class Ensure that the previous block in the map cannot be a goal or wall if it is currently a goal or wall block.
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/utils/mapGenerator.ts:84:22
 					this.numberWall--;
 					return 0;
 				}
-				if (value === 3) {
-					this.numberGoal--;
-					return 0;
-				}
+				if (value === 3) {}
 			}
 
killedBy: MapGenerator Class Ensure that the previous block in the map cannot be a goal or wall if it is currently a goal or wall block.
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] EqualityOperator
src/utils/mapGenerator.ts:105:29
 			const endIndex = startIndex + blockPerLine;
 			let tmpArray = this.level
 				.slice(startIndex, endIndex)
-				.filter((blockValue) => blockValue === 0);
+				.filter((blockValue) => blockValue !== 0);
 
 			if (tmpArray.length > blockPerLine - 3) {
killedBy: MapGenerator Class Generate Map with the player starting position chosen within the map.
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 2
Received:   1

[Killed] ArrayDeclaration
src/utils/mapGenerator.ts:110:16
 			if (tmpArray.length > blockPerLine - 3) {
 				this.level[startIndex + 1] = 4;
 			} else {
-				tmpArray = [];
+				tmpArray = ["Stryker was here"];
 			}
 			startIndex = endIndex;
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   1
