[Survived] BooleanLiteral
src/App.tsx:15:60
 function App() {
 
   // Internal State 
-  const [displayHighScore, setDisplayHighScore] = useState(false);
+  const [displayHighScore, setDisplayHighScore] = useState(true);
 
   // Redux State

[Survived] ArrowFunction
src/App.tsx:18:29
   const [displayHighScore, setDisplayHighScore] = useState(false);
 
   // Redux State
-  const speed = useSelector((state: rootState) => state.gameState.speed)
+  const speed = useSelector(() => undefined)
   const gameOver = useSelector((state: rootState) => state.gameState.gameOver)
   const mute = useSelector((state: rootState) => state.gameState.mute)

[Survived] ArrowFunction
src/App.tsx:19:32
 
   // Redux State
   const speed = useSelector((state: rootState) => state.gameState.speed)
-  const gameOver = useSelector((state: rootState) => state.gameState.gameOver)
+  const gameOver = useSelector(() => undefined)
   const mute = useSelector((state: rootState) => state.gameState.mute)
 

[Survived] ArrowFunction
src/App.tsx:20:28
   // Redux State
   const speed = useSelector((state: rootState) => state.gameState.speed)
   const gameOver = useSelector((state: rootState) => state.gameState.gameOver)
-  const mute = useSelector((state: rootState) => state.gameState.mute)
+  const mute = useSelector(() => undefined)
 
   // Get myMap

[Survived] BlockStatement
src/App.tsx:28:22
   myMap.onePlayerMap();
 
   if (gameOver) {
-    setTimeout(() => { setDisplayHighScore(true) }, 2000)
+    setTimeout(() => {}, 2000)
   }
 

[Survived] BooleanLiteral
src/App.tsx:28:44
   myMap.onePlayerMap();
 
   if (gameOver) {
-    setTimeout(() => { setDisplayHighScore(true) }, 2000)
+    setTimeout(() => { setDisplayHighScore(false) }, 2000)
   }
 

[Survived] BooleanLiteral
src/App.tsx:33:62
 
   return (
     <div className="center">
-      {<MusicLoop music={"gameover"} mute={gameOver ? mute : true} />}
+      {<MusicLoop music={"gameover"} mute={gameOver ? mute : false} />}
       <MusicLoop music={"theme"} mute={gameOver ? true : mute} />
       {displayHighScore ?

[Survived] BooleanLiteral
src/App.tsx:34:51
   return (
     <div className="center">
       {<MusicLoop music={"gameover"} mute={gameOver ? mute : true} />}
-      <MusicLoop music={"theme"} mute={gameOver ? true : mute} />
+      <MusicLoop music={"theme"} mute={gameOver ? false : mute} />
       {displayHighScore ?
         <HighScore />

[Survived] StringLiteral
src/App.tsx:34:25
   return (
     <div className="center">
       {<MusicLoop music={"gameover"} mute={gameOver ? mute : true} />}
-      <MusicLoop music={"theme"} mute={gameOver ? true : mute} />
+      <MusicLoop music={""} mute={gameOver ? true : mute} />
       {displayHighScore ?
         <HighScore />
