[Survived] BlockStatement
src/AppWrapper.tsx:7:23
 import App from './App';
 
 
-function AppWrapper() {
-
-	return (
-		<Provider store={store}>
-			<App />
-		</Provider>
-	);
-}
+function AppWrapper() {}
 
 export default AppWrapper;
