[Killed] BlockStatement
src/components/Block/Block.tsx:22:96
  * @returns A block element displayed in the game.
  */
 
-export function Block({ topPosition, leftPosition, pixelSize, type }: BlockProps): JSX.Element {
-
-	return (
-		<div className={`block ${type}`} role="img" style={
-			{
-				height: `${pixelSize}px`,
-				width: `${pixelSize}px`,
-				top: `${topPosition}px`,
-				left: `${leftPosition}px`,
-			}}>
-
-		</div>)
-}
+export function Block({ topPosition, leftPosition, pixelSize, type }: BlockProps): JSX.Element {}
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 0

[Killed] StringLiteral
src/components/Block/Block.tsx:25:19
 export function Block({ topPosition, leftPosition, pixelSize, type }: BlockProps): JSX.Element {
 
 	return (
-		<div className={`block ${type}`} role="img" style={
+		<div className={``} role="img" style={
 			{
 				height: `${pixelSize}px`,
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 0

[Killed] StringLiteral
src/components/Block/Block.tsx:27:13
 	return (
 		<div className={`block ${type}`} role="img" style={
 			{
-				height: `${pixelSize}px`,
+				height: ``,
 				width: `${pixelSize}px`,
 				top: `${topPosition}px`,
killedBy: Block Component renders block with their accurate style ?
statusReason: Error: expect(element).toHaveStyle()

- Expected

- height: 5px;
  left: 161px;
  top: 160px;
  width: 5px;

[Killed] StringLiteral
src/components/Block/Block.tsx:29:10
 			{
 				height: `${pixelSize}px`,
 				width: `${pixelSize}px`,
-				top: `${topPosition}px`,
+				top: ``,
 				left: `${leftPosition}px`,
 			}}>
killedBy: Block Component renders block with their accurate style ?
statusReason: Error: expect(element).toHaveStyle()

- Expected

  height: 26px;
  left: 131px;
- top: 79px;
  width: 26px;
