[Killed] BlockStatement
src/components/MusicLoop/MusicLoop.tsx:16:73
  * @example 
  * <MusicLoop music={"gameover"} mute={gameOver ? false : true} />
  */
-export function MusicLoop({ music, mute }: MusicLoopProps): JSX.Element {
-
-	const [interaction, setInteraction] = useState<boolean>(false);
-
-	useKey(window, {
-		ArrowUp: (event) => setInteraction(true),
-		ArrowDown: (event) => setInteraction(true),
-	})
-
-	if (interaction) {
-		return (
-			<audio data-testid="audio" autoPlay={true} loop muted={mute} key={music}>
-				<source data-testid="source" src={require(`./${music}.mp3`)} type="audio/mp3" />
-			</audio>
-		)
-	}
-	else {
-		return (<></>);
-	}
-
-}
+export function MusicLoop({ music, mute }: MusicLoopProps): JSX.Element {}
killedBy: MusicLoop component renders audio after user interaction (arrow key press)
statusReason: Error: Unable to find an element by: [data-testid="audio"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/components/MusicLoop/MusicLoop.tsx:18:58
  */
 export function MusicLoop({ music, mute }: MusicLoopProps): JSX.Element {
 
-	const [interaction, setInteraction] = useState<boolean>(false);
+	const [interaction, setInteraction] = useState<boolean>(true);
 
 	useKey(window, {
killedBy: MusicLoop component renders audio after user interaction (arrow key press)
statusReason: Error: expect(received).toBeNull()

Received: <audio autoplay="" data-testid="audio" loop=""><source data-testid="source" src="gameover.mp3" type="audio/mp3" /></audio>

[Survived] BooleanLiteral
src/components/MusicLoop/MusicLoop.tsx:21:38
 	const [interaction, setInteraction] = useState<boolean>(false);
 
 	useKey(window, {
-		ArrowUp: (event) => setInteraction(true),
+		ArrowUp: (event) => setInteraction(false),
 		ArrowDown: (event) => setInteraction(true),
 	})

[Survived] ArrowFunction
src/components/MusicLoop/MusicLoop.tsx:21:12
 	const [interaction, setInteraction] = useState<boolean>(false);
 
 	useKey(window, {
-		ArrowUp: (event) => setInteraction(true),
+		ArrowUp: () => undefined,
 		ArrowDown: (event) => setInteraction(true),
 	})

[Killed] BooleanLiteral
src/components/MusicLoop/MusicLoop.tsx:22:40
 
 	useKey(window, {
 		ArrowUp: (event) => setInteraction(true),
-		ArrowDown: (event) => setInteraction(true),
+		ArrowDown: (event) => setInteraction(false),
 	})
 
killedBy: MusicLoop component renders audio after user interaction (arrow key press)
statusReason: Error: Unable to find an element by: [data-testid="audio"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ArrowFunction
src/components/MusicLoop/MusicLoop.tsx:22:14
 
 	useKey(window, {
 		ArrowUp: (event) => setInteraction(true),
-		ArrowDown: (event) => setInteraction(true),
+		ArrowDown: () => undefined,
 	})
 

[Killed] ConditionalExpression
src/components/MusicLoop/MusicLoop.tsx:25:6
 		ArrowDown: (event) => setInteraction(true),
 	})
 
-	if (interaction) {
+	if (true) {
 		return (
 			<audio data-testid="audio" autoPlay={true} loop muted={mute} key={music}>
killedBy: MusicLoop component renders audio after user interaction (arrow key press)
statusReason: Error: expect(received).toBeNull()

Received: <audio autoplay="" data-testid="audio" loop=""><source data-testid="source" src="gameover.mp3" type="audio/mp3" /></audio>

[Killed] ConditionalExpression
src/components/MusicLoop/MusicLoop.tsx:25:6
 		ArrowDown: (event) => setInteraction(true),
 	})
 
-	if (interaction) {
+	if (false) {
 		return (
 			<audio data-testid="audio" autoPlay={true} loop muted={mute} key={music}>
killedBy: MusicLoop component renders audio after user interaction (arrow key press)
statusReason: Error: Unable to find an element by: [data-testid="audio"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] BooleanLiteral
src/components/MusicLoop/MusicLoop.tsx:27:41
 
 	if (interaction) {
 		return (
-			<audio data-testid="audio" autoPlay={true} loop muted={mute} key={music}>
+			<audio data-testid="audio" autoPlay={false} loop muted={mute} key={music}>
 				<source data-testid="source" src={require(`./${music}.mp3`)} type="audio/mp3" />
 			</audio>

[Killed] StringLiteral
src/components/MusicLoop/MusicLoop.tsx:28:47
 	if (interaction) {
 		return (
 			<audio data-testid="audio" autoPlay={true} loop muted={mute} key={music}>
-				<source data-testid="source" src={require(`./${music}.mp3`)} type="audio/mp3" />
+				<source data-testid="source" src={require(``)} type="audio/mp3" />
 			</audio>
 		)
killedBy: MusicLoop component renders audio after user interaction (arrow key press)
statusReason: Error: expect(element).toHaveAttribute("src", StringContaining "gameover.mp3") // element.getAttribute("src") === StringContaining "gameover.mp3"

Expected the element to have attribute:
  src=StringContaining "gameover.mp3"
Received:
  src="[object Object]"

[Survived] BlockStatement
src/components/MusicLoop/MusicLoop.tsx:32:7
 			</audio>
 		)
 	}
-	else {
-		return (<></>);
-	}
+	else {}
 
 }
