[Survived] ArrowFunction
src/components/Player/Player.tsx:27:27
 export function Player(props: PlayerProps): JSX.Element {
 
 	const { topPosition, leftPosition, pixelSize, setKeyPressed, sound } = props;
-	const mute = useSelector((state: rootState) => state.gameState.mute)
+	const mute = useSelector(() => undefined)
 
 	useKey(window, {

[Survived] ObjectLiteral
src/components/Player/Player.tsx:29:17
 	const { topPosition, leftPosition, pixelSize, setKeyPressed, sound } = props;
 	const mute = useSelector((state: rootState) => state.gameState.mute)
 
-	useKey(window, {
-		ArrowUp: (event) => setKeyPressed("Up"),
-		ArrowDown: (event) => setKeyPressed("Down"),
-	})
+	useKey(window, {})
 
 	useEffect(() => {

[Survived] ArrowFunction
src/components/Player/Player.tsx:30:12
 	const mute = useSelector((state: rootState) => state.gameState.mute)
 
 	useKey(window, {
-		ArrowUp: (event) => setKeyPressed("Up"),
+		ArrowUp: () => undefined,
 		ArrowDown: (event) => setKeyPressed("Down"),
 	})

[Survived] ArrowFunction
src/components/Player/Player.tsx:31:14
 
 	useKey(window, {
 		ArrowUp: (event) => setKeyPressed("Up"),
-		ArrowDown: (event) => setKeyPressed("Down"),
+		ArrowDown: () => undefined,
 	})
 

[Survived] StringLiteral
src/components/Player/Player.tsx:31:39
 
 	useKey(window, {
 		ArrowUp: (event) => setKeyPressed("Up"),
-		ArrowDown: (event) => setKeyPressed("Down"),
+		ArrowDown: (event) => setKeyPressed(""),
 	})
 

[Survived] BlockStatement
src/components/Player/Player.tsx:34:18
 		ArrowDown: (event) => setKeyPressed("Down"),
 	})
 
-	useEffect(() => {
-		if (mute) return;
-
-		try {
-			const audio = new Audio(require(`./${sound}.wav`));
-			audio.play();
-		}
-		catch (e) {
-
-		}
-	}, [sound, mute])
+	useEffect(() => {}, [sound, mute])
 
 

[Survived] ConditionalExpression
src/components/Player/Player.tsx:35:7
 	})
 
 	useEffect(() => {
-		if (mute) return;
+		if (true) return;
 
 		try {

[Survived] ConditionalExpression
src/components/Player/Player.tsx:35:7
 	})
 
 	useEffect(() => {
-		if (mute) return;
+		if (false) return;
 
 		try {

[Survived] BlockStatement
src/components/Player/Player.tsx:37:7
 	useEffect(() => {
 		if (mute) return;
 
-		try {
-			const audio = new Audio(require(`./${sound}.wav`));
-			audio.play();
-		}
+		try {}
 		catch (e) {
 

[Survived] ArrayDeclaration
src/components/Player/Player.tsx:44:5
 		catch (e) {
 
 		}
-	}, [sound, mute])
+	}, [])
 
 

[Survived] ObjectLiteral
src/components/Player/Player.tsx:49:4
 
 	return (
 		<div className="player" role="img" style={
-			{
-				height: `${pixelSize}px`,
-				width: `${pixelSize}px`,
-				top: `${topPosition}px`,
-				left: `${leftPosition}px`,
-			}}>
+			{}}>
 		</div>
 	)

[Survived] StringLiteral
src/components/Player/Player.tsx:51:12
 		<div className="player" role="img" style={
 			{
 				height: `${pixelSize}px`,
-				width: `${pixelSize}px`,
+				width: ``,
 				top: `${topPosition}px`,
 				left: `${leftPosition}px`,

[Survived] StringLiteral
src/components/Player/Player.tsx:53:11
 				height: `${pixelSize}px`,
 				width: `${pixelSize}px`,
 				top: `${topPosition}px`,
-				left: `${leftPosition}px`,
+				left: ``,
 			}}>
 		</div>
