[Killed] BooleanLiteral
src/components/Score/Score.tsx:27:52
 	const { score, isItActualPlayer } = props;
 	const [name, setName] = useState<string>(props.name);
 	
-	const [keyEnter, setKeyEnter] = useState<boolean>(false);
+	const [keyEnter, setKeyEnter] = useState<boolean>(true);
 	const [scoreSubmit, setScoreSubmit] = useState<boolean>(false);
 
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: expect(element).toBeEnabled()

Received element is not enabled:
  <input class="name" disabled="" maxlength="10" value="Name" />

[Survived] BooleanLiteral
src/components/Score/Score.tsx:28:58
 	const [name, setName] = useState<string>(props.name);
 	
 	const [keyEnter, setKeyEnter] = useState<boolean>(false);
-	const [scoreSubmit, setScoreSubmit] = useState<boolean>(false);
+	const [scoreSubmit, setScoreSubmit] = useState<boolean>(true);
 
 	useKey(window, {

[Survived] ArrowFunction
src/components/Score/Score.tsx:31:10
 	const [scoreSubmit, setScoreSubmit] = useState<boolean>(false);
 
 	useKey(window, {
-		Enter: () => setKeyEnter(true),
+		Enter: () => undefined,
 	})
 

[Survived] BooleanLiteral
src/components/Score/Score.tsx:31:28
 	const [scoreSubmit, setScoreSubmit] = useState<boolean>(false);
 
 	useKey(window, {
-		Enter: () => setKeyEnter(true),
+		Enter: () => setKeyEnter(false),
 	})
 

[Killed] BlockStatement
src/components/Score/Score.tsx:34:38
 		Enter: () => setKeyEnter(true),
 	})
 
-	const checkName = (name: string) => {
-		if (regexUser.test(name)) {
-			setName(name);
-		}
-
-		if (name.length === 0) {
-			setName("");
-		}
-	}
+	const checkName = (name: string) => {}
 
 	const registerScore = async () => {
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Name"

[Killed] ConditionalExpression
src/components/Score/Score.tsx:35:7
 	})
 
 	const checkName = (name: string) => {
-		if (regexUser.test(name)) {
+		if (true) {
 			setName(name);
 		}
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "0🍋*"

[Killed] ConditionalExpression
src/components/Score/Score.tsx:35:7
 	})
 
 	const checkName = (name: string) => {
-		if (regexUser.test(name)) {
+		if (false) {
 			setName(name);
 		}
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Name"

[Killed] BlockStatement
src/components/Score/Score.tsx:39:26
 			setName(name);
 		}
 
-		if (name.length === 0) {
-			setName("");
-		}
+		if (name.length === 0) {}
 	}
 
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "N"

[Killed] ConditionalExpression
src/components/Score/Score.tsx:39:7
 			setName(name);
 		}
 
-		if (name.length === 0) {
+		if (false) {
 			setName("");
 		}
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "N"

[Survived] BlockStatement
src/components/Score/Score.tsx:44:36
 		}
 	}
 
-	const registerScore = async () => {
-		if (!scoreSubmit) {
-			const connection: any = await connectSupaBase();
-			await insertScore(connection, { name: name, score: score });
-			setScoreSubmit(true);
-		}
-	}
+	const registerScore = async () => {}
 
 	if (keyEnter && isItActualPlayer) { registerScore(); }

[Survived] BooleanLiteral
src/components/Score/Score.tsx:45:7
 	}
 
 	const registerScore = async () => {
-		if (!scoreSubmit) {
+		if (scoreSubmit) {
 			const connection: any = await connectSupaBase();
 			await insertScore(connection, { name: name, score: score });

[Survived] ConditionalExpression
src/components/Score/Score.tsx:45:7
 	}
 
 	const registerScore = async () => {
-		if (!scoreSubmit) {
+		if (false) {
 			const connection: any = await connectSupaBase();
 			await insertScore(connection, { name: name, score: score });

[Killed] ObjectLiteral
src/components/Score/Score.tsx:47:34
 	const registerScore = async () => {
 		if (!scoreSubmit) {
 			const connection: any = await connectSupaBase();
-			await insertScore(connection, { name: name, score: score });
+			await insertScore(connection, {});
 			setScoreSubmit(true);
 		}
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')

[Survived] BooleanLiteral
src/components/Score/Score.tsx:48:19
 		if (!scoreSubmit) {
 			const connection: any = await connectSupaBase();
 			await insertScore(connection, { name: name, score: score });
-			setScoreSubmit(true);
+			setScoreSubmit(false);
 		}
 	}

[Survived] BlockStatement
src/components/Score/Score.tsx:52:36
 		}
 	}
 
-	if (keyEnter && isItActualPlayer) { registerScore(); }
+	if (keyEnter && isItActualPlayer) {}
 
 

[Survived] ConditionalExpression
src/components/Score/Score.tsx:52:6
 		}
 	}
 
-	if (keyEnter && isItActualPlayer) { registerScore(); }
+	if (false) { registerScore(); }
 
 

[Killed] BlockStatement
src/components/Score/Score.tsx:55:59
 	if (keyEnter && isItActualPlayer) { registerScore(); }
 
 
-	const displayInputScore = (isItActualPlayer: boolean) => {
-		if (isItActualPlayer) {
-			return (
-				<input className={keyEnter ? 'name' : 'name animate'}
-					onChange={(e) => checkName(e.target.value)}
-					value={name}
-					maxLength={10}
-					disabled={keyEnter ? true : false}
-					autoFocus={true}
-				/>
-			)
-		}
-		else {
-			return (
-				<div className="name">{name}</div>
-			)
-		}
-	}
+	const displayInputScore = (isItActualPlayer: boolean) => {}
 
 	return (
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: Unable to find role="textbox"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] BlockStatement
src/components/Score/Score.tsx:56:25
 
 
 	const displayInputScore = (isItActualPlayer: boolean) => {
-		if (isItActualPlayer) {
-			return (
-				<input className={keyEnter ? 'name' : 'name animate'}
-					onChange={(e) => checkName(e.target.value)}
-					value={name}
-					maxLength={10}
-					disabled={keyEnter ? true : false}
-					autoFocus={true}
-				/>
-			)
-		}
+		if (isItActualPlayer) {}
 		else {
 			return (
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: Unable to find role="textbox"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Killed] ConditionalExpression
src/components/Score/Score.tsx:56:7
 
 
 	const displayInputScore = (isItActualPlayer: boolean) => {
-		if (isItActualPlayer) {
+		if (false) {
 			return (
 				<input className={keyEnter ? 'name' : 'name animate'}
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: Unable to find role="textbox"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="highscore"
    >

[Survived] StringLiteral
src/components/Score/Score.tsx:58:34
 	const displayInputScore = (isItActualPlayer: boolean) => {
 		if (isItActualPlayer) {
 			return (
-				<input className={keyEnter ? 'name' : 'name animate'}
+				<input className={keyEnter ? "" : 'name animate'}
 					onChange={(e) => checkName(e.target.value)}
 					value={name}

[Killed] ArrowFunction
src/components/Score/Score.tsx:59:16
 		if (isItActualPlayer) {
 			return (
 				<input className={keyEnter ? 'name' : 'name animate'}
-					onChange={(e) => checkName(e.target.value)}
+					onChange={() => undefined}
 					value={name}
 					maxLength={10}
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Name"

[Killed] BooleanLiteral
src/components/Score/Score.tsx:62:34
 					onChange={(e) => checkName(e.target.value)}
 					value={name}
 					maxLength={10}
-					disabled={keyEnter ? true : false}
+					disabled={keyEnter ? true : true}
 					autoFocus={true}
 				/>
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: expect(element).toBeEnabled()

Received element is not enabled:
  <input class="name animate" disabled="" maxlength="10" value="Name" />

[Survived] BooleanLiteral
src/components/Score/Score.tsx:62:27
 					onChange={(e) => checkName(e.target.value)}
 					value={name}
 					maxLength={10}
-					disabled={keyEnter ? true : false}
+					disabled={keyEnter ? false : false}
 					autoFocus={true}
 				/>

[Killed] BooleanLiteral
src/components/Score/Score.tsx:63:17
 					value={name}
 					maxLength={10}
 					disabled={keyEnter ? true : false}
-					autoFocus={true}
+					autoFocus={false}
 				/>
 			)
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Name"

[Survived] BlockStatement
src/components/Score/Score.tsx:67:8
 				/>
 			)
 		}
-		else {
-			return (
-				<div className="name">{name}</div>
-			)
-		}
+		else {}
 	}
 

[Survived] StringLiteral
src/components/Score/Score.tsx:76:39
 
 	return (
 		<div className="scores">
-			<div className={isItActualPlayer ? 'player_score' : ''}>
+			<div className={isItActualPlayer ? "" : ''}>
 				{displayInputScore(isItActualPlayer)}
 			</div>
