[Killed] BlockStatement
src/components/SoundControl/SoundControl.tsx:10:45
 /**
  * @return A Sound Control component that displays whether the sound is muted or not and updates the sound in the Redux store.
  */
-export function SoundControl(): JSX.Element {
-
-	const dispatch = useDispatch();
-	const mute = useSelector((state: rootState) => state.gameState.mute)
-
-	return (
-		<div onClick={() => dispatch(setMute(!mute))} className="sound_control">
-			Sound {mute ? "Off 🔇" : "On 🔊"}
-		</div>
-	);
-	
-}
+export function SoundControl(): JSX.Element {}
killedBy: Sound Control Component Component is visible and we can switch menu settings Off/On
statusReason: Error: Unable to find an element with the text: Sound Off 🔇. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/components/SoundControl/SoundControl.tsx:13:27
 export function SoundControl(): JSX.Element {
 
 	const dispatch = useDispatch();
-	const mute = useSelector((state: rootState) => state.gameState.mute)
+	const mute = useSelector(() => undefined)
 
 	return (
killedBy: Sound Control Component Component is visible and we can switch menu settings Off/On
statusReason: Error: Unable to find an element with the text: Sound Off 🔇. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sound_control"
    >

[Killed] ArrowFunction
src/components/SoundControl/SoundControl.tsx:16:17
 	const mute = useSelector((state: rootState) => state.gameState.mute)
 
 	return (
-		<div onClick={() => dispatch(setMute(!mute))} className="sound_control">
+		<div onClick={() => undefined} className="sound_control">
 			Sound {mute ? "Off 🔇" : "On 🔊"}
 		</div>
killedBy: Sound Control Component Component is visible and we can switch menu settings Off/On
statusReason: Error: Unable to find an element with the text: Sound On 🔊. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sound_control"
    >

[Killed] BooleanLiteral
src/components/SoundControl/SoundControl.tsx:16:40
 	const mute = useSelector((state: rootState) => state.gameState.mute)
 
 	return (
-		<div onClick={() => dispatch(setMute(!mute))} className="sound_control">
+		<div onClick={() => dispatch(setMute(mute))} className="sound_control">
 			Sound {mute ? "Off 🔇" : "On 🔊"}
 		</div>
killedBy: Sound Control Component Component is visible and we can switch menu settings Off/On
statusReason: Error: Unable to find an element with the text: Sound On 🔊. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sound_control"
    >

[Killed] StringLiteral
src/components/SoundControl/SoundControl.tsx:17:29
 
 	return (
 		<div onClick={() => dispatch(setMute(!mute))} className="sound_control">
-			Sound {mute ? "Off 🔇" : "On 🔊"}
+			Sound {mute ? "Off 🔇" : """
 		</div>
 	);
killedBy: Sound Control Component Component is visible and we can switch menu settings Off/On
statusReason: Error: Unable to find an element with the text: Sound On 🔊. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sound_control"
    >
