[Killed] BlockStatement
src/data/supabase.ts:10:35
 /**
  * @returns A supabase client connected to the database
  */
-export function connectSupaBase() {
-	const supabaseUrl = 'https://urhlfvmxrgmupsrkfkhk.supabase.co';
-	const supabaseKey = process.env.REACT_APP_API_KEY ?? "";
-	return createClient(supabaseUrl, supabaseKey);
-}
+export function connectSupaBase() {}
 
 /**
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of undefined (reading 'from')

[Killed] LogicalOperator
src/data/supabase.ts:12:22
  */
 export function connectSupaBase() {
 	const supabaseUrl = 'https://urhlfvmxrgmupsrkfkhk.supabase.co';
-	const supabaseKey = process.env.REACT_APP_API_KEY ?? "";
+	const supabaseKey = process.env.REACT_APP_API_KEY && "";
 	return createClient(supabaseUrl, supabaseKey);
 }
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: Error: supabaseKey is required.

[Killed] BlockStatement
src/data/supabase.ts:20:48
  * @param supabase A Supabase client
  * @returns Return all data from the database as a array of object or return false if the operation fails.
  */
-export async function readScore(supabase: any) {
-	const response = await supabase.from('boule_infernal').select('*');
-	const responseData = response.data ?? false;
-
-	if (!responseData && response.status !== 200) { return false; };
-
-	const dataDecrypted = responseData.map((value) => {
-		value.score = decryptData(value.score);
-		value.score = Number(value.score);
-		return value;
-	})
-
-	return dataDecrypted.filter((a: ScoreObject) => regexUser.test(a.name))
-}
+export async function readScore(supabase: any) {}
 
 /**
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of undefined (reading 'sort')

[Killed] StringLiteral
src/data/supabase.ts:21:39
  * @returns Return all data from the database as a array of object or return false if the operation fails.
  */
 export async function readScore(supabase: any) {
-	const response = await supabase.from('boule_infernal').select('*');
+	const response = await supabase.from("").select('*');
 	const responseData = response.data ?? false;
 
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: responseData.map is not a function

[Killed] LogicalOperator
src/data/supabase.ts:22:23
  */
 export async function readScore(supabase: any) {
 	const response = await supabase.from('boule_infernal').select('*');
-	const responseData = response.data ?? false;
+	const responseData = response.data && false;
 
 	if (!responseData && response.status !== 200) { return false; };
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: responseData.map is not a function

[Killed] BooleanLiteral
src/data/supabase.ts:22:40
  */
 export async function readScore(supabase: any) {
 	const response = await supabase.from('boule_infernal').select('*');
-	const responseData = response.data ?? false;
+	const responseData = response.data ?? true;
 
 	if (!responseData && response.status !== 200) { return false; };
killedBy: Database Tests Unable Read Data Successfully
statusReason: TypeError: responseData.map is not a function

[Killed] BlockStatement
src/data/supabase.ts:24:48
 	const response = await supabase.from('boule_infernal').select('*');
 	const responseData = response.data ?? false;
 
-	if (!responseData && response.status !== 200) { return false; };
+	if (!responseData && response.status !== 200) {};
 
 	const dataDecrypted = responseData.map((value) => {
killedBy: Database Tests Unable Read Data Successfully
statusReason: TypeError: responseData.map is not a function

[Killed] ConditionalExpression
src/data/supabase.ts:24:6
 	const response = await supabase.from('boule_infernal').select('*');
 	const responseData = response.data ?? false;
 
-	if (!responseData && response.status !== 200) { return false; };
+	if (false) { return false; };
 
 	const dataDecrypted = responseData.map((value) => {
killedBy: Database Tests Unable Read Data Successfully
statusReason: TypeError: responseData.map is not a function

[Killed] BlockStatement
src/data/supabase.ts:26:52
 
 	if (!responseData && response.status !== 200) { return false; };
 
-	const dataDecrypted = responseData.map((value) => {
-		value.score = decryptData(value.score);
-		value.score = Number(value.score);
-		return value;
-	})
+	const dataDecrypted = responseData.map((value) => {})
 
 	return dataDecrypted.filter((a: ScoreObject) => regexUser.test(a.name))
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Survived] ArrowFunction
src/data/supabase.ts:32:30
 		return value;
 	})
 
-	return dataDecrypted.filter((a: ScoreObject) => regexUser.test(a.name))
+	return dataDecrypted.filter(() => undefined)
 }
 

[Survived] MethodExpression
src/data/supabase.ts:32:9
 		return value;
 	})
 
-	return dataDecrypted.filter((a: ScoreObject) => regexUser.test(a.name))
+	return dataDecrypted
 }
 

[Killed] BlockStatement
src/data/supabase.ts:41:76
  * @param scoreObject The score object with name propriety as a string & score propriety as a number 
  * @returns True if the values were inserted successfully, false if an error occurred.
  */
-export async function insertScore(supabase: any, scoreObject: ScoreObject) {
-	const response = await supabase.from('boule_infernal').insert({
-		name: scoreObject.name,
-		score: encryptData(scoreObject.score.toString()),
-	});
-	if (response.status === 201) { return true; }
-	return false;
-}
+export async function insertScore(supabase: any, scoreObject: ScoreObject) {}
killedBy: Database Tests Insert Data Successfully
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/data/supabase.ts:46:6
 		name: scoreObject.name,
 		score: encryptData(scoreObject.score.toString()),
 	});
-	if (response.status === 201) { return true; }
+	if (false) { return true; }
 	return false;
 }
killedBy: Database Tests Read Data Successfully
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] EqualityOperator
src/data/supabase.ts:46:6
 		name: scoreObject.name,
 		score: encryptData(scoreObject.score.toString()),
 	});
-	if (response.status === 201) { return true; }
+	if (response.status !== 201) { return true; }
 	return false;
 }
killedBy: Database Tests Insert Data Successfully
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] BooleanLiteral
src/data/supabase.ts:47:9
 		score: encryptData(scoreObject.score.toString()),
 	});
 	if (response.status === 201) { return true; }
-	return false;
+	return true;
 }
