[Survived] StringLiteral
src/hook/useGameMouvement.tsx:22:80
 	const [moveMap, setMoveMap] = useState<Array<number>>(mapLevel);
 	const [keyPressed, setKeyPressed] = useState<"Up" | "Down" | "">("");
 	const [playerDirection, setPlayerDirection] = useState<number>(1);
-	const [blockHit, setBlockHit] = useState<"empty" | "green" | "wall" | "goal">("empty");
+	const [blockHit, setBlockHit] = useState<"empty" | "green" | "wall" | "goal">("");
 	const [stop, setStop] = useState(false);
 

[Survived] BooleanLiteral
src/hook/useGameMouvement.tsx:23:35
 	const [keyPressed, setKeyPressed] = useState<"Up" | "Down" | "">("");
 	const [playerDirection, setPlayerDirection] = useState<number>(1);
 	const [blockHit, setBlockHit] = useState<"empty" | "green" | "wall" | "goal">("empty");
-	const [stop, setStop] = useState(false);
+	const [stop, setStop] = useState(true);
 
 

[Killed] BooleanLiteral
src/hook/useGameMouvement.tsx:29:8
 	useEffect(() => {
 
 		const timer = setTimeout(() => {
-			if (!stop) {
+			if (stop) {
 				// Copy moveMap and find player index
 				const newMoveMap = [...moveMap];
killedBy: Game Scene Player move when a key is pressed
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not 333

[Killed] ConditionalExpression
src/hook/useGameMouvement.tsx:29:8
 	useEffect(() => {
 
 		const timer = setTimeout(() => {
-			if (!stop) {
+			if (false) {
 				// Copy moveMap and find player index
 				const newMoveMap = [...moveMap];
killedBy: Game Scene Player move when a key is pressed
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not 333

[Killed] ArrowFunction
src/hook/useGameMouvement.tsx:32:41
 			if (!stop) {
 				// Copy moveMap and find player index
 				const newMoveMap = [...moveMap];
-				let playerIndex = moveMap.findIndex((value) => value === 4);
+				let playerIndex = moveMap.findIndex(() => undefined);
 
 				// Keyboard Vertical Movement
killedBy: Game Scene Player move when a key is pressed
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not 333

[Killed] EqualityOperator
src/hook/useGameMouvement.tsx:32:52
 			if (!stop) {
 				// Copy moveMap and find player index
 				const newMoveMap = [...moveMap];
-				let playerIndex = moveMap.findIndex((value) => value === 4);
+				let playerIndex = moveMap.findIndex((value) => value !== 4);
 
 				// Keyboard Vertical Movement
killedBy: Game Scene Player move when a key is pressed
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not 333

[Survived] ConditionalExpression
src/hook/useGameMouvement.tsx:35:32
 				let playerIndex = moveMap.findIndex((value) => value === 4);
 
 				// Keyboard Vertical Movement
-				if (keyPressed === "Up" && playerIndex > blockPerLine * 2) {
+				if (keyPressed === "Up" && true) {
 					playerIndex += -blockPerLine;
 					newMoveMap[playerIndex + blockPerLine] = 0;

[Survived] ConditionalExpression
src/hook/useGameMouvement.tsx:35:9
 				let playerIndex = moveMap.findIndex((value) => value === 4);
 
 				// Keyboard Vertical Movement
-				if (keyPressed === "Up" && playerIndex > blockPerLine * 2) {
+				if (true) {
 					playerIndex += -blockPerLine;
 					newMoveMap[playerIndex + blockPerLine] = 0;

[Survived] UnaryOperator
src/hook/useGameMouvement.tsx:36:21
 
 				// Keyboard Vertical Movement
 				if (keyPressed === "Up" && playerIndex > blockPerLine * 2) {
-					playerIndex += -blockPerLine;
+					playerIndex += +blockPerLine;
 					newMoveMap[playerIndex + blockPerLine] = 0;
 				}

[Survived] AssignmentOperator
src/hook/useGameMouvement.tsx:36:6
 
 				// Keyboard Vertical Movement
 				if (keyPressed === "Up" && playerIndex > blockPerLine * 2) {
-					playerIndex += -blockPerLine;
+					playerIndex -= -blockPerLine;
 					newMoveMap[playerIndex + blockPerLine] = 0;
 				}

[Survived] ArithmeticOperator
src/hook/useGameMouvement.tsx:37:17
 				// Keyboard Vertical Movement
 				if (keyPressed === "Up" && playerIndex > blockPerLine * 2) {
 					playerIndex += -blockPerLine;
-					newMoveMap[playerIndex + blockPerLine] = 0;
+					newMoveMap[playerIndex - blockPerLine] = 0;
 				}
 

[Survived] ArithmeticOperator
src/hook/useGameMouvement.tsx:40:68
 					newMoveMap[playerIndex + blockPerLine] = 0;
 				}
 
-				if (keyPressed === "Down" && playerIndex < newMoveMap.length - blockPerLine * 2) {
+				if (keyPressed === "Down" && playerIndex < newMoveMap.length - blockPerLine / 2) {
 					playerIndex += blockPerLine;
 					newMoveMap[playerIndex - blockPerLine] = 0;

[Survived] BlockStatement
src/hook/useGameMouvement.tsx:40:86
 					newMoveMap[playerIndex + blockPerLine] = 0;
 				}
 
-				if (keyPressed === "Down" && playerIndex < newMoveMap.length - blockPerLine * 2) {
-					playerIndex += blockPerLine;
-					newMoveMap[playerIndex - blockPerLine] = 0;
-				}
+				if (keyPressed === "Down" && playerIndex < newMoveMap.length - blockPerLine * 2) {}
 
 				// Horizontal Movement 

[Survived] AssignmentOperator
src/hook/useGameMouvement.tsx:41:6
 				}
 
 				if (keyPressed === "Down" && playerIndex < newMoveMap.length - blockPerLine * 2) {
-					playerIndex += blockPerLine;
+					playerIndex -= blockPerLine;
 					newMoveMap[playerIndex - blockPerLine] = 0;
 				}

[Survived] ArithmeticOperator
src/hook/useGameMouvement.tsx:42:17
 
 				if (keyPressed === "Down" && playerIndex < newMoveMap.length - blockPerLine * 2) {
 					playerIndex += blockPerLine;
-					newMoveMap[playerIndex - blockPerLine] = 0;
+					newMoveMap[playerIndex + blockPerLine] = 0;
 				}
 

[Survived] ArithmeticOperator
src/hook/useGameMouvement.tsx:46:51
 				}
 
 				// Horizontal Movement 
-				const horizontalBlock = moveMap[playerIndex + playerDirection * 2];
+				const horizontalBlock = moveMap[playerIndex + playerDirection / 2];
 				if (horizontalBlock !== 0 && playerDirection === 1) { setPlayerDirection(-1); }
 				if (horizontalBlock !== 0 && playerDirection === -1) { setPlayerDirection(1); }

[Survived] ArithmeticOperator
src/hook/useGameMouvement.tsx:46:37
 				}
 
 				// Horizontal Movement 
-				const horizontalBlock = moveMap[playerIndex + playerDirection * 2];
+				const horizontalBlock = moveMap[playerIndex - playerDirection * 2];
 				if (horizontalBlock !== 0 && playerDirection === 1) { setPlayerDirection(-1); }
 				if (horizontalBlock !== 0 && playerDirection === -1) { setPlayerDirection(1); }

[Survived] UnaryOperator
src/hook/useGameMouvement.tsx:47:78
 
 				// Horizontal Movement 
 				const horizontalBlock = moveMap[playerIndex + playerDirection * 2];
-				if (horizontalBlock !== 0 && playerDirection === 1) { setPlayerDirection(-1); }
+				if (horizontalBlock !== 0 && playerDirection === 1) { setPlayerDirection(+1); }
 				if (horizontalBlock !== 0 && playerDirection === -1) { setPlayerDirection(1); }
 

[Survived] ConditionalExpression
src/hook/useGameMouvement.tsx:47:9
 
 				// Horizontal Movement 
 				const horizontalBlock = moveMap[playerIndex + playerDirection * 2];
-				if (horizontalBlock !== 0 && playerDirection === 1) { setPlayerDirection(-1); }
+				if (false) { setPlayerDirection(-1); }
 				if (horizontalBlock !== 0 && playerDirection === -1) { setPlayerDirection(1); }
 

[Survived] LogicalOperator
src/hook/useGameMouvement.tsx:48:9
 				// Horizontal Movement 
 				const horizontalBlock = moveMap[playerIndex + playerDirection * 2];
 				if (horizontalBlock !== 0 && playerDirection === 1) { setPlayerDirection(-1); }
-				if (horizontalBlock !== 0 && playerDirection === -1) { setPlayerDirection(1); }
+				if (horizontalBlock !== 0 || playerDirection === -1) { setPlayerDirection(1); }
 
 				// Vertical / Horziontal Collision 

[Survived] EqualityOperator
src/hook/useGameMouvement.tsx:48:9
 				// Horizontal Movement 
 				const horizontalBlock = moveMap[playerIndex + playerDirection * 2];
 				if (horizontalBlock !== 0 && playerDirection === 1) { setPlayerDirection(-1); }
-				if (horizontalBlock !== 0 && playerDirection === -1) { setPlayerDirection(1); }
+				if (horizontalBlock === 0 && playerDirection === -1) { setPlayerDirection(1); }
 
 				// Vertical / Horziontal Collision 

[Survived] ArithmeticOperator
src/hook/useGameMouvement.tsx:51:35
 				if (horizontalBlock !== 0 && playerDirection === -1) { setPlayerDirection(1); }
 
 				// Vertical / Horziontal Collision 
-				const verticalBlock = moveMap[playerIndex + playerDirection];
+				const verticalBlock = moveMap[playerIndex - playerDirection];
 				const verticalBlock2 = moveMap[playerIndex];
 				if (verticalBlock === 0 || horizontalBlock === 0 || verticalBlock2 === 0) {

[Survived] ConditionalExpression
src/hook/useGameMouvement.tsx:53:57
 				// Vertical / Horziontal Collision 
 				const verticalBlock = moveMap[playerIndex + playerDirection];
 				const verticalBlock2 = moveMap[playerIndex];
-				if (verticalBlock === 0 || horizontalBlock === 0 || verticalBlock2 === 0) {
+				if (verticalBlock === 0 || horizontalBlock === 0 || false) {
 					setBlockHit("empty");
 				}

[Survived] BlockStatement
src/hook/useGameMouvement.tsx:53:79
 				// Vertical / Horziontal Collision 
 				const verticalBlock = moveMap[playerIndex + playerDirection];
 				const verticalBlock2 = moveMap[playerIndex];
-				if (verticalBlock === 0 || horizontalBlock === 0 || verticalBlock2 === 0) {
-					setBlockHit("empty");
-				}
+				if (verticalBlock === 0 || horizontalBlock === 0 || verticalBlock2 === 0) {}
 
 				if (verticalBlock === 1 || horizontalBlock === 1 || verticalBlock2 === 1) {

[Survived] ConditionalExpression
src/hook/useGameMouvement.tsx:57:57
 					setBlockHit("empty");
 				}
 
-				if (verticalBlock === 1 || horizontalBlock === 1 || verticalBlock2 === 1) {
+				if (verticalBlock === 1 || horizontalBlock === 1 || false) {
 					setBlockHit("green");
 				}

[Survived] ConditionalExpression
src/hook/useGameMouvement.tsx:57:9
 					setBlockHit("empty");
 				}
 
-				if (verticalBlock === 1 || horizontalBlock === 1 || verticalBlock2 === 1) {
+				if (true) {
 					setBlockHit("green");
 				}

[Survived] EqualityOperator
src/hook/useGameMouvement.tsx:61:57
 					setBlockHit("green");
 				}
 
-				if (verticalBlock === 2 || horizontalBlock === 2 || verticalBlock2 === 2) {
+				if (verticalBlock === 2 || horizontalBlock === 2 || verticalBlock2 !== 2) {
 					setBlockHit("wall");
 				}

[Survived] EqualityOperator
src/hook/useGameMouvement.tsx:61:9
 					setBlockHit("green");
 				}
 
-				if (verticalBlock === 2 || horizontalBlock === 2 || verticalBlock2 === 2) {
+				if (verticalBlock !== 2 || horizontalBlock === 2 || verticalBlock2 === 2) {
 					setBlockHit("wall");
 				}

[Survived] ConditionalExpression
src/hook/useGameMouvement.tsx:65:32
 					setBlockHit("wall");
 				}
 
-				if (verticalBlock === 3 || horizontalBlock === 3 || verticalBlock2 === 3) {
+				if (verticalBlock === 3 || false || verticalBlock2 === 3) {
 					newMoveMap[playerIndex + playerDirection * 2] = 0;
 					setBlockHit("goal");

[Survived] EqualityOperator
src/hook/useGameMouvement.tsx:65:32
 					setBlockHit("wall");
 				}
 
-				if (verticalBlock === 3 || horizontalBlock === 3 || verticalBlock2 === 3) {
+				if (verticalBlock === 3 || horizontalBlock !== 3 || verticalBlock2 === 3) {
 					newMoveMap[playerIndex + playerDirection * 2] = 0;
 					setBlockHit("goal");

[Survived] ArithmeticOperator
src/hook/useGameMouvement.tsx:66:17
 				}
 
 				if (verticalBlock === 3 || horizontalBlock === 3 || verticalBlock2 === 3) {
-					newMoveMap[playerIndex + playerDirection * 2] = 0;
+					newMoveMap[playerIndex - playerDirection * 2] = 0;
 					setBlockHit("goal");
 				}

[Survived] ArithmeticOperator
src/hook/useGameMouvement.tsx:66:31
 				}
 
 				if (verticalBlock === 3 || horizontalBlock === 3 || verticalBlock2 === 3) {
-					newMoveMap[playerIndex + playerDirection * 2] = 0;
+					newMoveMap[playerIndex + playerDirection / 2] = 0;
 					setBlockHit("goal");
 				}

[Survived] ArithmeticOperator
src/hook/useGameMouvement.tsx:73:16
 				setKeyPressed("");
 				// Update moveMap
 				newMoveMap[playerIndex] = 0;
-				newMoveMap[playerIndex + playerDirection] = 4;
+				newMoveMap[playerIndex - playerDirection] = 4;
 				setMoveMap(newMoveMap);
 			}

[Survived] ArrayDeclaration
src/hook/useGameMouvement.tsx:80:5
 
 		return () => clearTimeout(timer);
 
-	}, [moveMap, keyPressed, playerDirection, blockPerLine, blockHit, speed, stop]);
+	}, []);
 
 	return [moveMap, blockHit, setKeyPressed, setStop] as const;
