[Killed] BlockStatement
src/hook/useGameState.tsx:13:102
  * @param numberGoal The number goal in the Level
  * @returns A hook that updates Score, GameOver, and Speed when (Level completed) using Redux as a dependency.
  */
-export default function useGameState(block: "empty" | "green" | "wall" | "goal", numberGoal: number) {
-
-	const dispatch = useDispatch();
-	const score = useSelector((state: rootState) => state.gameState.score)
-	const maxScore = useSelector((state: rootState) => state.gameState.maxScore)
-	const gameOver = useSelector((state: rootState) => state.gameState.gameOver)
-	const speed = useSelector((state: rootState) => state.gameState.speed)
-
-
-	useEffect(() => {
-		if (block === "goal" && gameOver !== true) {
-			dispatch(setScore(score + 1));
-		}
-		if (block === "wall") {
-			dispatch(setGameOver(true))
-		}
-		if (score === numberGoal + maxScore) {
-			dispatch(setMaxScore(maxScore + numberGoal))
-			dispatch(setSpeed(speed - 0.5))
-		}
-	}, [block])
-
-
-	return [score, gameOver, maxScore, speed] as const;
-}
+export default function useGameState(block: "empty" | "green" | "wall" | "goal", numberGoal: number) {}
killedBy: Game Scene Game is displaying all blocks right
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Survived] ArrowFunction
src/hook/useGameState.tsx:16:28
 export default function useGameState(block: "empty" | "green" | "wall" | "goal", numberGoal: number) {
 
 	const dispatch = useDispatch();
-	const score = useSelector((state: rootState) => state.gameState.score)
+	const score = useSelector(() => undefined)
 	const maxScore = useSelector((state: rootState) => state.gameState.maxScore)
 	const gameOver = useSelector((state: rootState) => state.gameState.gameOver)

[Survived] ArrowFunction
src/hook/useGameState.tsx:17:31
 
 	const dispatch = useDispatch();
 	const score = useSelector((state: rootState) => state.gameState.score)
-	const maxScore = useSelector((state: rootState) => state.gameState.maxScore)
+	const maxScore = useSelector(() => undefined)
 	const gameOver = useSelector((state: rootState) => state.gameState.gameOver)
 	const speed = useSelector((state: rootState) => state.gameState.speed)

[Survived] ArrowFunction
src/hook/useGameState.tsx:18:31
 	const dispatch = useDispatch();
 	const score = useSelector((state: rootState) => state.gameState.score)
 	const maxScore = useSelector((state: rootState) => state.gameState.maxScore)
-	const gameOver = useSelector((state: rootState) => state.gameState.gameOver)
+	const gameOver = useSelector(() => undefined)
 	const speed = useSelector((state: rootState) => state.gameState.speed)
 

[Survived] ArrowFunction
src/hook/useGameState.tsx:19:28
 	const score = useSelector((state: rootState) => state.gameState.score)
 	const maxScore = useSelector((state: rootState) => state.gameState.maxScore)
 	const gameOver = useSelector((state: rootState) => state.gameState.gameOver)
-	const speed = useSelector((state: rootState) => state.gameState.speed)
+	const speed = useSelector(() => undefined)
 
 

[Survived] BlockStatement
src/hook/useGameState.tsx:22:18
 	const speed = useSelector((state: rootState) => state.gameState.speed)
 
 
-	useEffect(() => {
-		if (block === "goal" && gameOver !== true) {
-			dispatch(setScore(score + 1));
-		}
-		if (block === "wall") {
-			dispatch(setGameOver(true))
-		}
-		if (score === numberGoal + maxScore) {
-			dispatch(setMaxScore(maxScore + numberGoal))
-			dispatch(setSpeed(speed - 0.5))
-		}
-	}, [block])
+	useEffect(() => {}, [block])
 
 

[Survived] BooleanLiteral
src/hook/useGameState.tsx:23:40
 
 
 	useEffect(() => {
-		if (block === "goal" && gameOver !== true) {
+		if (block === "goal" && gameOver !== false) {
 			dispatch(setScore(score + 1));
 		}

[Survived] EqualityOperator
src/hook/useGameState.tsx:23:27
 
 
 	useEffect(() => {
-		if (block === "goal" && gameOver !== true) {
+		if (block === "goal" && gameOver === true) {
 			dispatch(setScore(score + 1));
 		}

[Survived] ArithmeticOperator
src/hook/useGameState.tsx:24:22
 
 	useEffect(() => {
 		if (block === "goal" && gameOver !== true) {
-			dispatch(setScore(score + 1));
+			dispatch(setScore(score - 1));
 		}
 		if (block === "wall") {

[Killed] EqualityOperator
src/hook/useGameState.tsx:26:7
 		if (block === "goal" && gameOver !== true) {
 			dispatch(setScore(score + 1));
 		}
-		if (block === "wall") {
+		if (block !== "wall") {
 			dispatch(setGameOver(true))
 		}
killedBy: Game Scene Player move when a key is pressed
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not 333

[Killed] ConditionalExpression
src/hook/useGameState.tsx:26:7
 		if (block === "goal" && gameOver !== true) {
 			dispatch(setScore(score + 1));
 		}
-		if (block === "wall") {
+		if (true) {
 			dispatch(setGameOver(true))
 		}
killedBy: Game Scene Player move when a key is pressed
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not 333

[Survived] BooleanLiteral
src/hook/useGameState.tsx:27:25
 			dispatch(setScore(score + 1));
 		}
 		if (block === "wall") {
-			dispatch(setGameOver(true))
+			dispatch(setGameOver(false))
 		}
 		if (score === numberGoal + maxScore) {

[Survived] BlockStatement
src/hook/useGameState.tsx:29:40
 		if (block === "wall") {
 			dispatch(setGameOver(true))
 		}
-		if (score === numberGoal + maxScore) {
-			dispatch(setMaxScore(maxScore + numberGoal))
-			dispatch(setSpeed(speed - 0.5))
-		}
+		if (score === numberGoal + maxScore) {}
 	}, [block])
 

[Survived] ConditionalExpression
src/hook/useGameState.tsx:29:7
 		if (block === "wall") {
 			dispatch(setGameOver(true))
 		}
-		if (score === numberGoal + maxScore) {
+		if (true) {
 			dispatch(setMaxScore(maxScore + numberGoal))
 			dispatch(setSpeed(speed - 0.5))

[Survived] ArithmeticOperator
src/hook/useGameState.tsx:30:25
 			dispatch(setGameOver(true))
 		}
 		if (score === numberGoal + maxScore) {
-			dispatch(setMaxScore(maxScore + numberGoal))
+			dispatch(setMaxScore(maxScore - numberGoal))
 			dispatch(setSpeed(speed - 0.5))
 		}

[Survived] ArithmeticOperator
src/hook/useGameState.tsx:31:22
 		}
 		if (score === numberGoal + maxScore) {
 			dispatch(setMaxScore(maxScore + numberGoal))
-			dispatch(setSpeed(speed - 0.5))
+			dispatch(setSpeed(speed + 0.5))
 		}
 	}, [block])
