[Killed] BlockStatement
src/redux/gameSlice.ts:14:66
 		// which detects changes to a "draft state" and produces a brand new
 		// immutable state based off those changes
 
-		setScore: (state: gameState, action: PayloadAction<number>) => {
-			state.score = action.payload;
-		},
+		setScore: (state: gameState, action: PayloadAction<number>) => {},
 
 		setMaxScore: (state: gameState, action: PayloadAction<number>) => {
killedBy: Game Slice should handle setScore
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: 0

[Killed] BlockStatement
src/redux/gameSlice.ts:18:69
 			state.score = action.payload;
 		},
 
-		setMaxScore: (state: gameState, action: PayloadAction<number>) => {
-			state.maxScore = action.payload;
-		},
+		setMaxScore: (state: gameState, action: PayloadAction<number>) => {},
 
 		setSpeed: (state: gameState, action: PayloadAction<number>) => {
killedBy: Game Slice should handle setMaxScore
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 100
Received: 0

[Killed] BlockStatement
src/redux/gameSlice.ts:22:66
 			state.maxScore = action.payload;
 		},
 
-		setSpeed: (state: gameState, action: PayloadAction<number>) => {
-			state.speed = action.payload;
-		},
+		setSpeed: (state: gameState, action: PayloadAction<number>) => {},
 
 		setGameOver: (state: gameState, action: PayloadAction<boolean>) => {
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] BlockStatement
src/redux/gameSlice.ts:26:70
 			state.speed = action.payload;
 		},
 
-		setGameOver: (state: gameState, action: PayloadAction<boolean>) => {
-			state.gameOver = action.payload;
-		},
+		setGameOver: (state: gameState, action: PayloadAction<boolean>) => {},
 
 		setMute: (state: gameState, action: PayloadAction<boolean>) => {
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] BlockStatement
src/redux/gameSlice.ts:30:66
 			state.gameOver = action.payload;
 		},
 
-		setMute: (state: gameState, action: PayloadAction<boolean>) => {
-			state.mute = action.payload; 
-		}
+		setMute: (state: gameState, action: PayloadAction<boolean>) => {}
 	},
 });
killedBy: Sound Control Component Component is visible and we can switch menu settings Off/On
statusReason: Error: Unable to find an element with the text: Sound On 🔊. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sound_control"
    >
