[Killed] ObjectLiteral
src/redux/store.ts:5:11
 import gameReducer from './gameSlice';
 
 export const store = configureStore({
-	reducer: {
-		gameState: gameReducer,
-	},
+	reducer: {},
 
 });
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of undefined (reading 'score')
