[Killed] BooleanLiteral
src/redux/initialStates.ts:12:12
 export const initialState: gameState = {
 	score: 0,
 	maxScore: 0,
-	gameOver: false,
+	gameOver: true,
 	speed: 50,  
 	mute: true,
killedBy: Game Scene Player move when a key is pressed
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not 333

[Killed] BooleanLiteral
src/redux/initialStates.ts:14:8
 	maxScore: 0,
 	gameOver: false,
 	speed: 50,  
-	mute: true,
+	mute: false,
 };
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')
