[Survived] BlockStatement
src/scene/Game.tsx:36:18
 	const [score, gameOver] = useGameState(blockHit, map.numberGoal);
 	
 	// Stop Game Mouvement if GameOver
-	useEffect(() => {
-		setStop(gameOver);
-	}, [gameOver, setStop])
+	useEffect(() => {}, [gameOver, setStop])
 
 

[Survived] ArithmeticOperator
src/scene/Game.tsx:42:25
 
 
 	// Draw the map
-	let topStart: number = (10 / 100) * widthGame;
+	let topStart: number = 10 / 100 / widthGame;
 	let leftStart: number = (10 / 100) * widthGame;
 	let pixelSize: number = Math.floor((6.67 / 100) * widthGame);

[Survived] ArithmeticOperator
src/scene/Game.tsx:42:26
 
 
 	// Draw the map
-	let topStart: number = (10 / 100) * widthGame;
+	let topStart: number = (10 * 100) * widthGame;
 	let leftStart: number = (10 / 100) * widthGame;
 	let pixelSize: number = Math.floor((6.67 / 100) * widthGame);

[Survived] ArithmeticOperator
src/scene/Game.tsx:43:27
 
 	// Draw the map
 	let topStart: number = (10 / 100) * widthGame;
-	let leftStart: number = (10 / 100) * widthGame;
+	let leftStart: number = (10 * 100) * widthGame;
 	let pixelSize: number = Math.floor((6.67 / 100) * widthGame);
 

[Survived] ArithmeticOperator
src/scene/Game.tsx:43:26
 
 	// Draw the map
 	let topStart: number = (10 / 100) * widthGame;
-	let leftStart: number = (10 / 100) * widthGame;
+	let leftStart: number = 10 / 100 / widthGame;
 	let pixelSize: number = Math.floor((6.67 / 100) * widthGame);
 

[Survived] ArithmeticOperator
src/scene/Game.tsx:44:37
 	// Draw the map
 	let topStart: number = (10 / 100) * widthGame;
 	let leftStart: number = (10 / 100) * widthGame;
-	let pixelSize: number = Math.floor((6.67 / 100) * widthGame);
+	let pixelSize: number = Math.floor(6.67 / 100 / widthGame);
 
 	return (

[Survived] ArithmeticOperator
src/scene/Game.tsx:44:38
 	// Draw the map
 	let topStart: number = (10 / 100) * widthGame;
 	let leftStart: number = (10 / 100) * widthGame;
-	let pixelSize: number = Math.floor((6.67 / 100) * widthGame);
+	let pixelSize: number = Math.floor((6.67 * 100) * widthGame);
 
 	return (

[Survived] StringLiteral
src/scene/Game.tsx:49:31
 	return (
 		<>
 			<SoundControl />
-			<div className={gameOver ? "game dead" : "game"} style={{
+			<div className={gameOver ? "" : "game"} style={{
 				width: `${widthGame}px`,
 				height: `${heightGame}px`,

[Survived] StringLiteral
src/scene/Game.tsx:50:12
 		<>
 			<SoundControl />
 			<div className={gameOver ? "game dead" : "game"} style={{
-				width: `${widthGame}px`,
+				width: ``,
 				height: `${heightGame}px`,
 				padding: `${topStart}px`,

[Killed] ArrowFunction
src/scene/Game.tsx:59:28
 					{moveMap.map((value, index): JSX.Element => {
 						let element: JSX.Element = <></>;
 
-						const createSprite = (type: "empty" | "green" | "wall" | "goal" | "player") => (
-							type === "player" ?
-
-								<Player
-									leftPosition={leftStart}
-									topPosition={topStart}
-									pixelSize={pixelSize}
-									setKeyPressed={setKeyPressed}
-									sound={blockHit}
-									key={index}
-								/>
-								:
-								<Block
-									leftPosition={leftStart}
-									topPosition={topStart}
-									pixelSize={pixelSize}
-									type={type}
-									key={index}
-								/>
-
-						);
+						const createSprite = () => undefined;
 
 						switch (value) {
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: Unable to find role="img"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="sound_control"
    >

[Killed] EqualityOperator
src/scene/Game.tsx:60:8
 						let element: JSX.Element = <></>;
 
 						const createSprite = (type: "empty" | "green" | "wall" | "goal" | "player") => (
-							type === "player" ?
+							type !== "player" ?
 
 								<Player
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/scene/Game.tsx:60:8
 						let element: JSX.Element = <></>;
 
 						const createSprite = (type: "empty" | "green" | "wall" | "goal" | "player") => (
-							type === "player" ?
+							true ?
 
 								<Player
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/scene/Game.tsx:82:8
 						);
 
 						switch (value) {
-							case 1:
-								element = createSprite("green");
-								break;
+							case 1:
 							case 2:
 								element = createSprite("wall");
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 81

[Killed] ConditionalExpression
src/scene/Game.tsx:85:8
 							case 1:
 								element = createSprite("green");
 								break;
-							case 2:
-								element = createSprite("wall");
-								break;
+							case 2:
 							case 3:
 								element = createSprite("goal");
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 10

[Killed] StringLiteral
src/scene/Game.tsx:86:32
 								element = createSprite("green");
 								break;
 							case 2:
-								element = createSprite("wall");
+								element = createSprite("");
 								break;
 							case 3:
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/scene/Game.tsx:88:8
 							case 2:
 								element = createSprite("wall");
 								break;
-							case 3:
-								element = createSprite("goal");
-								break;
+							case 3:
 							case 4:
 								element = createSprite("player");
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/scene/Game.tsx:91:8
 							case 3:
 								element = createSprite("goal");
 								break;
-							case 4:
-								element = createSprite("player");
-								break;
+							case 4:
 							default:
 								element = createSprite("empty");
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] StringLiteral
src/scene/Game.tsx:92:32
 								element = createSprite("goal");
 								break;
 							case 4:
-								element = createSprite("player");
+								element = createSprite("");
 								break;
 							default:
killedBy: Game Scene Game is displaying all blocks right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Survived] ConditionalExpression
src/scene/Game.tsx:94:8
 							case 4:
 								element = createSprite("player");
 								break;
-							default:
-								element = createSprite("empty");
-								break;
+							default:
 						}
 

[Survived] StringLiteral
src/scene/Game.tsx:95:32
 								element = createSprite("player");
 								break;
 							default:
-								element = createSprite("empty");
+								element = createSprite("");
 								break;
 						}

[Survived] ArithmeticOperator
src/scene/Game.tsx:99:19
 								break;
 						}
 
-						leftStart = leftStart + pixelSize;
+						leftStart = leftStart - pixelSize;
 
 						if (leftStart - pixelSize > widthGame) {

[Survived] ConditionalExpression
src/scene/Game.tsx:101:11
 
 						leftStart = leftStart + pixelSize;
 
-						if (leftStart - pixelSize > widthGame) {
+						if (true) {
 							leftStart = (10 / 100) * widthGame;
 							topStart = topStart + pixelSize;

[Survived] ArithmeticOperator
src/scene/Game.tsx:101:11
 
 						leftStart = leftStart + pixelSize;
 
-						if (leftStart - pixelSize > widthGame) {
+						if (leftStart + pixelSize > widthGame) {
 							leftStart = (10 / 100) * widthGame;
 							topStart = topStart + pixelSize;

[Survived] ArithmeticOperator
src/scene/Game.tsx:102:21
 						leftStart = leftStart + pixelSize;
 
 						if (leftStart - pixelSize > widthGame) {
-							leftStart = (10 / 100) * widthGame;
+							leftStart = (10 * 100) * widthGame;
 							topStart = topStart + pixelSize;
 						}

[Survived] ArithmeticOperator
src/scene/Game.tsx:102:20
 						leftStart = leftStart + pixelSize;
 
 						if (leftStart - pixelSize > widthGame) {
-							leftStart = (10 / 100) * widthGame;
+							leftStart = 10 / 100 / widthGame;
 							topStart = topStart + pixelSize;
 						}

[Survived] ArithmeticOperator
src/scene/Game.tsx:103:19
 
 						if (leftStart - pixelSize > widthGame) {
 							leftStart = (10 / 100) * widthGame;
-							topStart = topStart + pixelSize;
+							topStart = topStart - pixelSize;
 						}
 
