[Killed] ArrowFunction
src/scene/HighScore.tsx:13:30
 export default function HighScore(): JSX.Element {
 
 	// Retrieve My Score using Redux
-	const myScore = useSelector((state: rootState) => state.gameState.score);
+	const myScore = useSelector(() => undefined);
 
 	// Get All Scores
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')

[Killed] ArrayDeclaration
src/scene/HighScore.tsx:16:59
 	const myScore = useSelector((state: rootState) => state.gameState.score);
 
 	// Get All Scores
-	const [allHighScore, setAllHighScore] = useState<Scores>([]);
+	const [allHighScore, setAllHighScore] = useState<Scores>(["Stryker was here"]);
 
 	const loadAllScores = async () => {
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of undefined (reading 'slice')

[Survived] BlockStatement
src/scene/HighScore.tsx:18:36
 	// Get All Scores
 	const [allHighScore, setAllHighScore] = useState<Scores>([]);
 
-	const loadAllScores = async () => {
-		const connection: any = await connectSupaBase();
-		const readScores: any = await readScore(connection);
-		setAllHighScore(readScores);
-	}
+	const loadAllScores = async () => {}
 
 	useEffect(() => {

[Survived] BlockStatement
src/scene/HighScore.tsx:24:18
 		setAllHighScore(readScores);
 	}
 
-	useEffect(() => {
-		loadAllScores();
-	}, [])
+	useEffect(() => {}, [])
 
 	const topHighScore = allHighScore.sort((a, b) => a.score - b.score).reverse().slice(0, 15);

[Killed] ArrowFunction
src/scene/HighScore.tsx:28:41
 		loadAllScores();
 	}, [])
 
-	const topHighScore = allHighScore.sort((a, b) => a.score - b.score).reverse().slice(0, 15);
+	const topHighScore = allHighScore.sort(() => undefined).reverse().slice(0, 15);
 
 	// Recursive function generate "#"
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] ArithmeticOperator
src/scene/HighScore.tsx:28:51
 		loadAllScores();
 	}, [])
 
-	const topHighScore = allHighScore.sort((a, b) => a.score - b.score).reverse().slice(0, 15);
+	const topHighScore = allHighScore.sort((a, b) => a.score + b.score).reverse().slice(0, 15);
 
 	// Recursive function generate "#"
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] BlockStatement
src/scene/HighScore.tsx:31:50
 	const topHighScore = allHighScore.sort((a, b) => a.score - b.score).reverse().slice(0, 15);
 
 	// Recursive function generate "#"
-	const hashTag: any = (numberHashTag: number) => {
-		if (numberHashTag !== 0) {
-			return "#" + hashTag(numberHashTag - 1);
-		}
-		return "";
-	}
+	const hashTag: any = (numberHashTag: number) => {}
 
 	// Return Element Hash Tag 
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ConditionalExpression
src/scene/HighScore.tsx:32:7
 
 	// Recursive function generate "#"
 	const hashTag: any = (numberHashTag: number) => {
-		if (numberHashTag !== 0) {
+		if (true) {
 			return "#" + hashTag(numberHashTag - 1);
 		}
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: RangeError: Maximum call stack size exceeded

[Killed] EqualityOperator
src/scene/HighScore.tsx:32:7
 
 	// Recursive function generate "#"
 	const hashTag: any = (numberHashTag: number) => {
-		if (numberHashTag !== 0) {
+		if (numberHashTag === 0) {
 			return "#" + hashTag(numberHashTag - 1);
 		}
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] ArithmeticOperator
src/scene/HighScore.tsx:33:25
 	// Recursive function generate "#"
 	const hashTag: any = (numberHashTag: number) => {
 		if (numberHashTag !== 0) {
-			return "#" + hashTag(numberHashTag - 1);
+			return "#" + hashTag(numberHashTag + 1);
 		}
 		return "";
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
src/scene/HighScore.tsx:39:50
 	}
 
 	// Return Element Hash Tag 
-	const ElementHashTag = (hashTaglist: String) => {
-		const p = hashTaglist.split("");
-		return p.map((value: string, index: number) => {
-			const isInteger = Number.isInteger(index / 2);
-			if (isInteger) {
-				return <div key={index} className="color1">#</div>
-			}
-			return <div key={index} className="color2">#</div>
-		});
-	}
+	const ElementHashTag = (hashTaglist: String) => {}
 
 
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] BlockStatement
src/scene/HighScore.tsx:41:50
 	// Return Element Hash Tag 
 	const ElementHashTag = (hashTaglist: String) => {
 		const p = hashTaglist.split("");
-		return p.map((value: string, index: number) => {
-			const isInteger = Number.isInteger(index / 2);
-			if (isInteger) {
-				return <div key={index} className="color1">#</div>
-			}
-			return <div key={index} className="color2">#</div>
-		});
+		return p.map((value: string, index: number) => {});
 	}
 
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] ArithmeticOperator
src/scene/HighScore.tsx:42:39
 	const ElementHashTag = (hashTaglist: String) => {
 		const p = hashTaglist.split("");
 		return p.map((value: string, index: number) => {
-			const isInteger = Number.isInteger(index / 2);
+			const isInteger = Number.isInteger(index * 2);
 			if (isInteger) {
 				return <div key={index} className="color1">#</div>
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] ConditionalExpression
src/scene/HighScore.tsx:43:8
 		const p = hashTaglist.split("");
 		return p.map((value: string, index: number) => {
 			const isInteger = Number.isInteger(index / 2);
-			if (isInteger) {
+			if (false) {
 				return <div key={index} className="color1">#</div>
 			}
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] BlockStatement
src/scene/HighScore.tsx:43:19
 		const p = hashTaglist.split("");
 		return p.map((value: string, index: number) => {
 			const isInteger = Number.isInteger(index / 2);
-			if (isInteger) {
-				return <div key={index} className="color1">#</div>
-			}
+			if (isInteger) {}
 			return <div key={index} className="color2">#</div>
 		});
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] ArithmeticOperator
src/scene/HighScore.tsx:69:71
 			</div>
 			<div className="one_line">
 				<div className="group">{ElementHashTag(hashTag(3))}</div>
-				<Score name={"Name"} score={myScore} isItActualPlayer={true} key={topHighScore.length + 1} />
+				<Score name={"Name"} score={myScore} isItActualPlayer={true} key={topHighScore.length - 1} />
 				<div className="group">{ElementHashTag(hashTag(3))}</div>
 			</div>
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] BooleanLiteral
src/scene/HighScore.tsx:69:60
 			</div>
 			<div className="one_line">
 				<div className="group">{ElementHashTag(hashTag(3))}</div>
-				<Score name={"Name"} score={myScore} isItActualPlayer={true} key={topHighScore.length + 1} />
+				<Score name={"Name"} score={myScore} isItActualPlayer={false} key={topHighScore.length + 1} />
 				<div className="group">{ElementHashTag(hashTag(3))}</div>
 			</div>
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] BlockStatement
src/scene/HighScore.tsx:72:40
 				<Score name={"Name"} score={myScore} isItActualPlayer={true} key={topHighScore.length + 1} />
 				<div className="group">{ElementHashTag(hashTag(3))}</div>
 			</div>
-			{topHighScore.map((value, index) => {
-				return (
-					<div className="one_line">
-						<div className="group">{ElementHashTag(hashTag(3))}</div>
-						<Score key={index} name={value.name.slice(0,10)} score={value.score} isItActualPlayer={false} />
-						<div className="group">{ElementHashTag(hashTag(3))}</div>
-					</div>
-				)
-			})}
+			{topHighScore.map((value, index) => {})}
 			<div className="one_line">
 				<div className="group">
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] MethodExpression
src/scene/HighScore.tsx:76:32
 				return (
 					<div className="one_line">
 						<div className="group">{ElementHashTag(hashTag(3))}</div>
-						<Score key={index} name={value.name.slice(0,10)} score={value.score} isItActualPlayer={false} />
+						<Score key={index} name={value.name} score={value.score} isItActualPlayer={false} />
 						<div className="group">{ElementHashTag(hashTag(3))}</div>
 					</div>
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')

[Killed] BooleanLiteral
src/scene/HighScore.tsx:76:94
 				return (
 					<div className="one_line">
 						<div className="group">{ElementHashTag(hashTag(3))}</div>
-						<Score key={index} name={value.name.slice(0,10)} score={value.score} isItActualPlayer={false} />
+						<Score key={index} name={value.name.slice(0,10)} score={value.score} isItActualPlayer={true} />
 						<div className="group">{ElementHashTag(hashTag(3))}</div>
 					</div>
killedBy: Score Scene "Score Player Input" is visible and ensure that only text can be entered when submitting the score
statusReason: TypeError: Cannot read properties of null (reading 'salt')
