[Killed] BlockStatement
src/utils/mapGenerator.ts:38:4
 		defaultMapLevel: Array<number>,
 		numberMaxWall: number,
 		numberMaxGoal: number
-	) {
-		this.level = defaultMapLevel;
-		this.numberWall = 0;
-		this.numberGoal = 0;
-		this.numberMaxWall = numberMaxWall;
-		this.numberMaxGoal = numberMaxGoal;
-
-		this.generateMapLevel();
-	}
+	) {}
 
 	/**
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/utils/mapGenerator.ts:52:42
 	 *@returns An object with the updated property "level","numberWall","numberGoal" representing the generated map.
 	 */
 	generateMapLevel() {
-		this.level = this.level.map((value) => {
-			// Random a number
-			const randomNumber = Math.round(Math.random() * 50);
-
-			// Do not replace green blocks in the default map level.
-			if (value === 1 || randomNumber === 1) return value;
-
-			// Do not generate wall blocks if the maximum number of wall blocks has been reached.
-			if (randomNumber === 2 && this.numberWall < this.numberMaxWall) {
-				this.numberWall++;
-				return randomNumber;
-			}
-
-			// Do not generate goal blocks if the maximum number of goal blocks has been reached.
-			if (randomNumber === 3 && this.numberGoal < this.numberMaxGoal) {
-				this.numberGoal++;
-				return randomNumber;
-			}
-
-			return value;
-		});
+		this.level = this.level.map((value) => {});
 
 		// Avoid that in the map previous block is the same if it's a goal block or wall block
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 2
Received:   0

[Survived] ArithmeticOperator
src/utils/mapGenerator.ts:54:36
 	generateMapLevel() {
 		this.level = this.level.map((value) => {
 			// Random a number
-			const randomNumber = Math.round(Math.random() * 50);
+			const randomNumber = Math.round(Math.random() / 50);
 
 			// Do not replace green blocks in the default map level.

[Survived] ConditionalExpression
src/utils/mapGenerator.ts:57:8
 			const randomNumber = Math.round(Math.random() * 50);
 
 			// Do not replace green blocks in the default map level.
-			if (value === 1 || randomNumber === 1) return value;
+			if (true) return value;
 
 			// Do not generate wall blocks if the maximum number of wall blocks has been reached.

[Survived] ConditionalExpression
src/utils/mapGenerator.ts:57:23
 			const randomNumber = Math.round(Math.random() * 50);
 
 			// Do not replace green blocks in the default map level.
-			if (value === 1 || randomNumber === 1) return value;
+			if (value === 1 || false) return value;
 
 			// Do not generate wall blocks if the maximum number of wall blocks has been reached.

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:60:8
 			if (value === 1 || randomNumber === 1) return value;
 
 			// Do not generate wall blocks if the maximum number of wall blocks has been reached.
-			if (randomNumber === 2 && this.numberWall < this.numberMaxWall) {
+			if (true) {
 				this.numberWall++;
 				return randomNumber;
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] LogicalOperator
src/utils/mapGenerator.ts:60:8
 			if (value === 1 || randomNumber === 1) return value;
 
 			// Do not generate wall blocks if the maximum number of wall blocks has been reached.
-			if (randomNumber === 2 && this.numberWall < this.numberMaxWall) {
+			if (randomNumber === 2 || this.numberWall < this.numberMaxWall) {
 				this.numberWall++;
 				return randomNumber;
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] UpdateOperator
src/utils/mapGenerator.ts:61:5
 
 			// Do not generate wall blocks if the maximum number of wall blocks has been reached.
 			if (randomNumber === 2 && this.numberWall < this.numberMaxWall) {
-				this.numberWall++;
+				this.numberWall--;
 				return randomNumber;
 			}

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:66:8
 			}
 
 			// Do not generate goal blocks if the maximum number of goal blocks has been reached.
-			if (randomNumber === 3 && this.numberGoal < this.numberMaxGoal) {
+			if (true) {
 				this.numberGoal++;
 				return randomNumber;
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
src/utils/mapGenerator.ts:66:30
 			}
 
 			// Do not generate goal blocks if the maximum number of goal blocks has been reached.
-			if (randomNumber === 3 && this.numberGoal < this.numberMaxGoal) {
+			if (randomNumber === 3 && this.numberGoal <= this.numberMaxGoal) {
 				this.numberGoal++;
 				return randomNumber;
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] UpdateOperator
src/utils/mapGenerator.ts:67:5
 
 			// Do not generate goal blocks if the maximum number of goal blocks has been reached.
 			if (randomNumber === 3 && this.numberGoal < this.numberMaxGoal) {
-				this.numberGoal++;
+				this.numberGoal--;
 				return randomNumber;
 			}

[Killed] BlockStatement
src/utils/mapGenerator.ts:75:63
 		});
 
 		// Avoid that in the map previous block is the same if it's a goal block or wall block
-		return this.level = this.level.map((value, index, array) => {
-			const previousValue = array[index - 1];
-			if (value === 1 || value === 0) {
-				return value;
-			}
-			if (previousValue === 2 || previousValue === 3) {
-				if (value === 2) {
-					this.numberWall--;
-				}
-				if (value === 3) {
-					this.numberGoal--;
-				}
-				return 0;
-			}
-			return value;
-		});
+		return this.level = this.level.map((value, index, array) => {});
 
 	}
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 2
Received:   0

[Survived] ArithmeticOperator
src/utils/mapGenerator.ts:76:32
 
 		// Avoid that in the map previous block is the same if it's a goal block or wall block
 		return this.level = this.level.map((value, index, array) => {
-			const previousValue = array[index - 1];
+			const previousValue = array[index + 1];
 			if (value === 1 || value === 0) {
 				return value;

[Survived] ConditionalExpression
src/utils/mapGenerator.ts:77:23
 		// Avoid that in the map previous block is the same if it's a goal block or wall block
 		return this.level = this.level.map((value, index, array) => {
 			const previousValue = array[index - 1];
-			if (value === 1 || value === 0) {
+			if (value === 1 || false) {
 				return value;
 			}

[Survived] BlockStatement
src/utils/mapGenerator.ts:77:36
 		// Avoid that in the map previous block is the same if it's a goal block or wall block
 		return this.level = this.level.map((value, index, array) => {
 			const previousValue = array[index - 1];
-			if (value === 1 || value === 0) {
-				return value;
-			}
+			if (value === 1 || value === 0) {}
 			if (previousValue === 2 || previousValue === 3) {
 				if (value === 2) {

[Survived] EqualityOperator
src/utils/mapGenerator.ts:80:8
 			if (value === 1 || value === 0) {
 				return value;
 			}
-			if (previousValue === 2 || previousValue === 3) {
+			if (previousValue !== 2 || previousValue === 3) {
 				if (value === 2) {
 					this.numberWall--;

[Survived] BlockStatement
src/utils/mapGenerator.ts:80:52
 			if (value === 1 || value === 0) {
 				return value;
 			}
-			if (previousValue === 2 || previousValue === 3) {
-				if (value === 2) {
-					this.numberWall--;
-				}
-				if (value === 3) {
-					this.numberGoal--;
-				}
-				return 0;
-			}
+			if (previousValue === 2 || previousValue === 3) {}
 			return value;
 		});

[Survived] ConditionalExpression
src/utils/mapGenerator.ts:81:9
 				return value;
 			}
 			if (previousValue === 2 || previousValue === 3) {
-				if (value === 2) {
+				if (true) {
 					this.numberWall--;
 				}

[Survived] EqualityOperator
src/utils/mapGenerator.ts:81:9
 				return value;
 			}
 			if (previousValue === 2 || previousValue === 3) {
-				if (value === 2) {
+				if (value !== 2) {
 					this.numberWall--;
 				}

[Survived] UpdateOperator
src/utils/mapGenerator.ts:82:6
 			}
 			if (previousValue === 2 || previousValue === 3) {
 				if (value === 2) {
-					this.numberWall--;
+					this.numberWall++;
 				}
 				if (value === 3) {

[Survived] EqualityOperator
src/utils/mapGenerator.ts:84:9
 				if (value === 2) {
 					this.numberWall--;
 				}
-				if (value === 3) {
+				if (value !== 3) {
 					this.numberGoal--;
 				}

[Survived] BlockStatement
src/utils/mapGenerator.ts:84:22
 				if (value === 2) {
 					this.numberWall--;
 				}
-				if (value === 3) {
-					this.numberGoal--;
-				}
+				if (value === 3) {}
 				return 0;
 			}

[Killed] UpdateOperator
src/utils/mapGenerator.ts:85:6
 					this.numberWall--;
 				}
 				if (value === 3) {
-					this.numberGoal--;
+					this.numberGoal++;
 				}
 				return 0;
killedBy: MapGenerator Class Generate Map with good numbers goal or wall
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/utils/mapGenerator.ts:97:53
 	/**
 	 * @returns An object with the updated property "level" representing the generated map, including all possible starting player choices display at "4" in the array
 	 */
-	addPlayersMap(blockPerLine: number): Array<number> {
-		let startIndex = blockPerLine;
-
-		while (startIndex < this.level.length) {
-			const endIndex = startIndex + blockPerLine;
-			let tmpArray = this.level
-				.slice(startIndex, endIndex)
-				.filter((blockValue) => blockValue === 0);
-
-			if (tmpArray.length > blockPerLine - 3) {
-				this.level[startIndex + 1] = 4;
-			} else {
-				tmpArray = [];
-			}
-			startIndex = endIndex;
-		}
-
-		return this.level;
-	}
+	addPlayersMap(blockPerLine: number): Array<number> {}
 
 	/**
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 2
Received:   0

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:100:10
 	addPlayersMap(blockPerLine: number): Array<number> {
 		let startIndex = blockPerLine;
 
-		while (startIndex < this.level.length) {
+		while (false) {
 			const endIndex = startIndex + blockPerLine;
 			let tmpArray = this.level
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 2
Received:   0

[Killed] EqualityOperator
src/utils/mapGenerator.ts:100:10
 	addPlayersMap(blockPerLine: number): Array<number> {
 		let startIndex = blockPerLine;
 
-		while (startIndex < this.level.length) {
+		while (startIndex >= this.level.length) {
 			const endIndex = startIndex + blockPerLine;
 			let tmpArray = this.level
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 2
Received:   0

[Timeout] ArithmeticOperator
src/utils/mapGenerator.ts:101:21
 		let startIndex = blockPerLine;
 
 		while (startIndex < this.level.length) {
-			const endIndex = startIndex + blockPerLine;
+			const endIndex = startIndex - blockPerLine;
 			let tmpArray = this.level
 				.slice(startIndex, endIndex)

[Survived] MethodExpression
src/utils/mapGenerator.ts:102:19
 
 		while (startIndex < this.level.length) {
 			const endIndex = startIndex + blockPerLine;
-			let tmpArray = this.level
-				.slice(startIndex, endIndex)
-				.filter((blockValue) => blockValue === 0);
+			let tmpArray = this.level.slice(startIndex, endIndex);
 
 			if (tmpArray.length > blockPerLine - 3) {

[Survived] MethodExpression
src/utils/mapGenerator.ts:102:19
 
 		while (startIndex < this.level.length) {
 			const endIndex = startIndex + blockPerLine;
-			let tmpArray = this.level
-				.slice(startIndex, endIndex)
+			let tmpArray = this.level
 				.filter((blockValue) => blockValue === 0);
 

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:104:29
 			const endIndex = startIndex + blockPerLine;
 			let tmpArray = this.level
 				.slice(startIndex, endIndex)
-				.filter((blockValue) => blockValue === 0);
+				.filter((blockValue) => false);
 
 			if (tmpArray.length > blockPerLine - 3) {
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 2
Received:   0

[Killed] ArrowFunction
src/utils/mapGenerator.ts:104:13
 			const endIndex = startIndex + blockPerLine;
 			let tmpArray = this.level
 				.slice(startIndex, endIndex)
-				.filter((blockValue) => blockValue === 0);
+				.filter(() => undefined);
 
 			if (tmpArray.length > blockPerLine - 3) {
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 2
Received:   0

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:106:8
 				.slice(startIndex, endIndex)
 				.filter((blockValue) => blockValue === 0);
 
-			if (tmpArray.length > blockPerLine - 3) {
+			if (false) {
 				this.level[startIndex + 1] = 4;
 			} else {
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 2
Received:   0

[Killed] ArithmeticOperator
src/utils/mapGenerator.ts:106:26
 				.slice(startIndex, endIndex)
 				.filter((blockValue) => blockValue === 0);
 
-			if (tmpArray.length > blockPerLine - 3) {
+			if (tmpArray.length > blockPerLine + 3) {
 				this.level[startIndex + 1] = 4;
 			} else {
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 2
Received:   0

[Survived] ArithmeticOperator
src/utils/mapGenerator.ts:107:16
 				.filter((blockValue) => blockValue === 0);
 
 			if (tmpArray.length > blockPerLine - 3) {
-				this.level[startIndex + 1] = 4;
+				this.level[startIndex - 1] = 4;
 			} else {
 				tmpArray = [];

[Survived] BlockStatement
src/utils/mapGenerator.ts:108:11
 
 			if (tmpArray.length > blockPerLine - 3) {
 				this.level[startIndex + 1] = 4;
-			} else {
-				tmpArray = [];
-			}
+			} else {}
 			startIndex = endIndex;
 		}

[Killed] BlockStatement
src/utils/mapGenerator.ts:120:32
 	/**
 	 * @returns An object with the updated property "level" representing the generated map with only one player starting choice
 	 */
-	onePlayerMap(): Array<number> {
-		const playersIndex = this.level.reduce((array, blockValue, index) => {
-			if (blockValue === 4) {
-				array.push(index);
-			}
-			return array;
-		}, [] as number[]);
-
-		const rndPlayerIndex = Math.floor(Math.random() * playersIndex.length);
-		const onePlayerIndex = playersIndex[rndPlayerIndex];
-
-		this.level = this.level.map((value) => (value === 4 ? 0 : value));
-		this.level[onePlayerIndex] = 4;
-
-		return this.level;
-	}
+	onePlayerMap(): Array<number> {}
 }
 
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 16

[Killed] BlockStatement
src/utils/mapGenerator.ts:121:72
 	 * @returns An object with the updated property "level" representing the generated map with only one player starting choice
 	 */
 	onePlayerMap(): Array<number> {
-		const playersIndex = this.level.reduce((array, blockValue, index) => {
-			if (blockValue === 4) {
-				array.push(index);
-			}
-			return array;
-		}, [] as number[]);
+		const playersIndex = this.level.reduce((array, blockValue, index) => {}, [] as number[]);
 
 		const rndPlayerIndex = Math.floor(Math.random() * playersIndex.length);
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/utils/mapGenerator.ts:122:26
 	 */
 	onePlayerMap(): Array<number> {
 		const playersIndex = this.level.reduce((array, blockValue, index) => {
-			if (blockValue === 4) {
-				array.push(index);
-			}
+			if (blockValue === 4) {}
 			return array;
 		}, [] as number[]);
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:122:8
 	 */
 	onePlayerMap(): Array<number> {
 		const playersIndex = this.level.reduce((array, blockValue, index) => {
-			if (blockValue === 4) {
+			if (false) {
 				array.push(index);
 			}
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Survived] ArithmeticOperator
src/utils/mapGenerator.ts:128:37
 			return array;
 		}, [] as number[]);
 
-		const rndPlayerIndex = Math.floor(Math.random() * playersIndex.length);
+		const rndPlayerIndex = Math.floor(Math.random() / playersIndex.length);
 		const onePlayerIndex = playersIndex[rndPlayerIndex];
 

[Killed] EqualityOperator
src/utils/mapGenerator.ts:131:43
 		const rndPlayerIndex = Math.floor(Math.random() * playersIndex.length);
 		const onePlayerIndex = playersIndex[rndPlayerIndex];
 
-		this.level = this.level.map((value) => (value === 4 ? 0 : value));
+		this.level = this.level.map((value) => (value !== 4 ? 0 : value));
 		this.level[onePlayerIndex] = 4;
 
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 17

[Killed] ConditionalExpression
src/utils/mapGenerator.ts:131:43
 		const rndPlayerIndex = Math.floor(Math.random() * playersIndex.length);
 		const onePlayerIndex = playersIndex[rndPlayerIndex];
 
-		this.level = this.level.map((value) => (value === 4 ? 0 : value));
+		this.level = this.level.map((value) => (false ? 0 : value));
 		this.level[onePlayerIndex] = 4;
 
killedBy: MapGenerator Class Generate a map with the player starting position chosen within the map.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 13
